[
  {
    "_id": "6950cb18e34a44bda8b79b30",
    "url": "https://www.myjoyonline.com/100-arrested-in-accras-tabora-in-major-mobile-money-fraud-crackdown/",
    "image": null,
    "text": "The Minister for Communications and Digital Innovation, Samuel Nartey George, has praised a major police-led operation that led to the arrest of 100 suspects in Tabora, a suburb of Accra, over alleged involvement in Mobile Money (MoMo) fraud and other cyber-enabled financial crimes.\n });\nThe coordinated operation, carried out in the early hours of Friday, December 27, involved the Cyber Security Authority (CSA), the Ghana Police Service, National Security, and the Ghana Immigration Service.\nAccording to the Minister, preliminary investigations indicate that the majority of the suspects are Nigerian nationals. Security agencies also seized 38 laptops and 150 mobile phones believed to have been used in committing the offences.\nThe suspected crimes include MoMo fraud, romance scams, sextortion, Business Email Compromise (BEC), and wire fraud.\nA Ghanaian landlord was also arrested for allegedly accommodating about 100 of the suspects in his residence.\n });\n“This operation demonstrates our commitment to protecting Ghanaians and the business environment from cybercrime. Landlords and property owners must ensure their premises are not used to facilitate illegal activity,” the Minister noted.\nHe added that forensic analysis of the seized devices is ongoing, and suspects found culpable will be prosecuted under Ghanaian law.\nMr George also urged the public to remain vigilant and report suspicious online activities, while reassuring investors and residents that Ghana remains open to lawful business.\n“We welcome legitimate enterprise, but anyone attempting cybercrime in Ghana will be found, arrested, and dealt with decisively,” he stated.\n });\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   Fraud Mobile Money Samuel Nartey George Tabora \n Advertisement \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n Sam George lauds coordinated crackdown on cybercrime in Tabora and Lashibi \n Ghana-Nigeria cyber-fraud network dupes over 200 victims of $400,000 \n Lawyer arraigned over alleged GH¢800k excavator fraud \n Cybercrime crackdown: 48 suspects arrested in Dawhenya operation \n Britain’s worst romance fraudster’ who scammed single mothers out of £1m is jailed for 17 years \n Ghana recovers over $15m from international crypto fraud syndicate – Attorney General \n MTN Mobile Money to undergo nationwide agent re-registration in 2026 to curb fraud \n People were leaking information to fraud suspects – Sam George on past failed cybercrime arrests \n Hubtel named Overall Best Fintech Partner at 2025 Fintech Stakeholder Dinner & Awards \n Mobile money transactions hits GH¢3trn as digital payments surge – BoG Report",
    "timestamp": "2025-12-28T06:16:24.331Z",
    "title": "100 arrested in Accra’s Tabora in major Mobile Money fraud crackdown"
  },
  {
    "_id": "6950cb39e34a44bda8b79b34",
    "url": "https://www.myjoyonline.com/kidnap-suspect-arrested-in-tamale-as-police-rescue-victim-after-four-days/",
    "image": null,
    "text": "A 26-year-old man, Fuseini Ibrahim, has been arrested in Tamale for allegedly kidnapping a young woman, Haruna Adamu, who was held captive for four days.\n });\nThe incident occurred at Dalogu Yili, a suburb of Tamale, and was reported to the police at about 9:00 a.m. on December 26.\nAccording to reports, the Inspector-General of Police’s (IGP) Special Operations Team, led by Chief Inspector Abdullai Tahiru, responded swiftly to the scene and rescued the victim without incident.\nThe suspect was apprehended and handed over to the Regional Criminal Investigations Department (CID) for further investigation, while the victim was safely reunited with her parents.\nMeanwhile, as part of a festive season crackdown on crime, two suspected drug peddlers were arrested in separate operations in Tamale.\n });\nThe suspects, Ziyad Inusah and Majid Fuseini, were picked up by the IGP Special Operations Team during a routine Christmas patrol.\nThe team, made up of 105 personnel in 10 vehicles, targeted crime-prone areas within the Tamale Metropolis and seized quantities of opioids from one of the suspects.\nThe Ghana Police Service said the operation reflects its commitment to protecting lives and property and intensifying efforts to clamp down on drug peddling and other criminal activities during the festive period.\n });\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   kidnap Tamale \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n 2 nurses, security guard arrested over alleged baby theft at Tamale hospital \n Police crack down on drug trafficking in Tamale, arrest 4 and seize illicit substances \n Tamale high court delays ruling in Anbariya vs. Technical University case \n Police arrest seven in Tamale drug crackdown, seize illicit substances \n IGP Special Operations Team nabs all-female suspected drug trafficking ring in Tamale \n Suspected criminal killed in gunfire exchange with police in Tamale \n Police Special Operations Team storms Tamale, arrests 32 suspects in major anti-crime sweep \n 19 suspects arrested in Tamale and environs during night swoop \n Police arrest 16 suspects in major crime crackdown in Tamale \n Tamale residents applaud Cowbell for annual Bike Caravan",
    "timestamp": "2025-12-28T06:16:57.913Z",
    "title": "Kidnap suspect arrested in Tamale as Police rescue victim after four days"
  },
  {
    "_id": "6950cb3ce34a44bda8b79b35",
    "url": "https://www.myjoyonline.com/dr-nyaho-nyaho-tamakloe-opposes-presidential-term-extension/",
    "image": null,
    "text": "Veteran Ghanaian statesman Dr Nyaho Nyaho-Tamakloe has strongly opposed proposals to extend Ghana’s presidential term, insisting that the existing two four-year terms are sufficient for effective governance.\n });\nIn a statement released this week regarding the ongoing constitutional review, Dr Nyaho-Tamakloe argued that “four years is adequate time for a serious and prepared government to make its mark,” adding that “arguments suggesting a need for additional time only create unnecessary opportunities for inefficiency and corruption.”\nThe former diplomat stressed that while continuity in governance is important, it should not be used as justification for lengthening presidential tenure. “Unfinished national projects must be continued by successive governments. The practice of abandoning ongoing projects in order to initiate new ones has become a major source of waste and corruption,” he said.\nRead Also: Dr Nyaho Nyaho-Tamakloe: On Ghana’s constitution review and the future of democratic governance\nDr Nyaho-Tamakloe also called for a review of provisions that grant excessive immunity and lifelong benefits to public office holders. “The Constitution contains numerous clauses that effectively shield the President during and even after his tenure in office. These protections make it nearly impossible to hold a President fully accountable under the law. This situation is no longer tenable in a mature democracy,” he noted. He further added that “the system of ex gratia payments and excessive post-office benefits for public office holders must be abolished,” urging that these resources be redirected to improve the lives of ordinary Ghanaians.\n });\nOn the structure of government, he supported reforms aimed at strengthening accountability, including appointing ministers strictly from outside Parliament to ensure a clear separation between the Executive and Legislature. “Parliament must be empowered to independently scrutinise government actions without conflict of interest,” he said.\nAddressing leadership qualifications, Dr Nyaho-Tamakloe emphasised that the presidency requires maturity and experience. “The minimum age requirement for presidential candidates should be reviewed upward to reflect the seriousness and responsibility of the office,” he said.\nThe statesman concluded by calling on all stakeholders to approach the constitutional review process with integrity and a focus on national interest. “Constitutional reform must not be driven by partisan interests but by the collective good of the nation,” he urged, highlighting the need for accountability, discipline, and responsible governance.\nDr. Nyaho-Tamakloe’s statement comes ahead of the expected release of the full report of the Constitution Review Committee, which is scheduled for January 2026.\n });\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   Constitution Review Committee Dr Nyaho Nyaho-Tamakloe presidential term extension \n Advertisement \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n Dr Nyaho Nyaho-Tamakloe calls for abolition of ex gratia payments, excessive benefits for public officeholders \n Dr Nyaho Nyaho-Tamakloe backs review of presidential immunity provisions in Ghana’s constitution \n Dr Nyaho Nyaho-Tamakloe: On Ghana’s constitution review and the future of democratic governance \n Why Ghana’s Constitution Review Committee’s Work Should Be Extended to Strategic Communication \n How presidential control has weakened Council of State – Prof H. Kwasi Prempeh explains \n A second look, not a veto – Constitution Review Chair makes case for Council of State reform \n Too young to lead? – Prof H. Kwasi Prempeh says Ghana’s Constitution undervalues its youth \n Let the people decide – Constitution Review Chair pushes back against fear of ‘young presidents’ \n Selective justice is destroying trust in Ghana’s anti-corruption system – Prof H. Kwasi Prempeh \n Ghana’s democratic debate is too insular and afraid of change – Constitution Review Chair",
    "timestamp": "2025-12-28T06:17:00.633Z",
    "title": "Dr Nyaho Nyaho-Tamakloe opposes presidential term extension"
  },
  {
    "_id": "6950cb3ee34a44bda8b79b36",
    "url": "https://www.myjoyonline.com/one-year-extension-of-presidential-term-unnecessary-baffuor-awuah/",
    "image": null,
    "text": "Vice Chair of Parliament’s Subsidiary Legislation Committee and a member of the Constitutional and Legal Affairs Committee, Nana Agyei Baffuor Awuah, has described the Constitution Review Committee’s (CRC) proposal to extend the presidential term from four to five years as unnecessary.\n });\nHe made the comments on Newsfile on JoyNews on Saturday, December 27.\nHis remarks follow the submission of the CRC’s final report to President John Dramani Mahama on Monday, December 22.\nThe report contains several key recommendations, including the separation of the legislature from the executive, a reaffirmation that the Constitution does not allow a third presidential term, and a proposal to extend the presidential term of office from four to five years.\nThe CRC has so far presented a summary of its findings to the President, with the full and final report expected to be made public in January.\n });\nSpeaking on the programme, Mr Baffuor Awuah stressed the need for a thorough comparative analysis of the CRC’s proposals against earlier constitutional review efforts, particularly the report of the Professor Fiadjo Committee.\n“When you look at the Fiadjo Commission’s report on the tenure of the president, they conducted a historical analysis of where the four years came from,” he explained.\n“The Consultative Assembly initially preferred five years, the Commission of Experts recommended four, and the Powers of Government Committee opted for five. After careful evaluation, they settled on four years.”\nHe questioned the rationale behind the proposed extension, arguing that the justification for giving presidents more time to complete projects is largely impractical.\n });\n“The fundamental question is: what mischief are we seeking to cure with this proposed extension? The so-called ‘mischief’ is about giving the president time to finish his work, but practically, no president can complete everything during his tenure,” he said.\nMr Baffuor Awuah noted that presidents routinely initiate projects, contract loans, and pass legislation whose full impact often extends beyond their time in office.\nExtending the term by just one year, he argued, would not change that reality.\n“The issue really has to do with continuity. We should focus on passing laws or mechanisms that ensure continuity, rather than simply extending the president’s term,” he said.\n });\n“Adding one more year will not enable the president to finish everything he starts. We need to look at how best we can achieve continuity effectively.”\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   Nana Agyei Baffuor Awuah presidential tenure \n Advertisement \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n I don’t believe OSP will disregard proper discretion – Lawyer on Charles Bissue’s arrest warrant",
    "timestamp": "2025-12-28T06:17:02.484Z",
    "title": "One-year extension of presidential term unnecessary – Baffuor Awuah"
  },
  {
    "_id": "6950cb3fe34a44bda8b79b37",
    "url": "https://www.myjoyonline.com/prof-prempeh-defends-lowering-presidential-age-cites-kufuors-early-leadership-roles/",
    "image": null,
    "text": "Professor Henry Kwasi Prempeh, Chairman of the Constitution Review Committee (CRC), has defended the committee’s recommendation to reduce the minimum age for presidential candidates to 30, responding to concerns that the proposal could allow inexperienced individuals to assume the nation’s highest office.\n });\nSpeaking on the historical context, Prof. Prempeh noted that former President John Kufuor held significant leadership roles at a much younger age.\n“In 1969, we had a ceremonial president, and I think the age was 40 or higher, but real power was with the Prime Minister and the Cabinet. To get into Cabinet, you had to come from Parliament, and the minimum age at the time was 21.\n\"So when former President Kufuor became a Deputy Minister, he was 21—not even 30—because the constitution allowed you to enter Parliament at 21, from where you could be picked as a Cabinet Minister or even Prime Minister,” he explained.\nProf. Prempeh stressed that the committee’s proposal aims to expand political participation and give young Ghanaians more opportunities to engage in leadership.\n });\nHe argued that age alone should not determine leadership capacity, pointing to historical examples where young leaders effectively contributed to governance.\nHe urged the public to view the recommendation within the broader context of constitutional reform, which seeks to modernise Ghana’s governance structures and reflect the aspirations of a youthful population.\nAccording to him, lowering the presidential age is part of making the political system more inclusive and forward-looking.\n });\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   Kufuor Prof. Prempeh \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n Celebrating Kufuor at 87: Arthur Kennedy hails statesman’s legacy \n Kufuor says some NPP members wanted him out after his 39% showing in the 1996 election \n I appointed my brother as Defence Minister because I knew he could deliver – Kufuor justifies \n Alan Kyerematen rejected my offer to serve as minister in 2000 – Kufuor reveals \n ‘I never backed Alan Kyerematen against Akufo-Addo’ – Kufuor clears air on old rumours \n NPP’s 2024 loss a wake-up call on governance and accountability – Kufuor \n Edudzi Tameklo pays courtesy call on fmr. President Kufuor ahead of NPA @20 celebrations \n Abronye did not disrespect Kufuor at NPP meeting — Acting National Chairman clarifies \n Kufuor hails Apostle Safo Kantanka as ‘a grace and a gift’ to Africa \n Kufuor calls for second chamber of Parliament to vet key appointments",
    "timestamp": "2025-12-28T06:17:03.539Z",
    "title": "Prof. Prempeh defends lowering presidential age, cites Kufuor’s early leadership roles"
  },
  {
    "_id": "6950cb60e34a44bda8b79b39",
    "url": "https://www.myjoyonline.com/meet-81-year-old-father-of-ucc-acting-vice-chancellor-who-recently-graduated-with-an-mba/",
    "image": null,
    "text": "For the 81-year-old Joseph Aheto, when he realised three years ago in 2022 that all his children had overtaken his level of education and were now professors, he decided to enroll at the University of Cape Coast (UCC) to pursue a Master of Business Administration (MBA) Programme.\n });\nHe obtained his first degree in Business Administration from the University of Ghana in 1978, according to a report published by the University of Cape Coast.\nNot wanting to cite age, family responsibilities, or being a pensioner as a reason to discourage him, he decided to go back to school and pursue higher education. \nHe chose to pursue an MBA in Entrepreneurship and Small Enterprise Development Studies at the UCC, where one of his sons, Prof Denis Aheto, was the then Pro-Vice-Chancellor and currently the acting Vice Chancellor.\nThankfully, he successfully went through the programme, and got his son, Prof Dennis Aheto, the current acting Vice Chancellor, congratulating him at the 9th session of the 58th congregation of the university.\n });\nSpeaking to the press, Mr Aheto said he was inspired to pursue further studies when he realised his two sons, who are both professors, had overtaken him.\n“I feel very excited to have my own son graduating me,” Mr Aheto told the press after the graduation ceremony.\nHe said apart from the grace of God, which made this feat possible, his family, course mates, and lecturers also motivated him to push on.\n“When I enrolled and commenced lectures, many of the younger students in my class were surprised and were laughing and mocking me. saying, ‘What at all does this old man want in life? But that didn't deter me. I soldiered on, and now I have graduated,\" he said.\n });\nAccording to him, no one should feel too old to go back to school, as learning remains a lifelong adventure.\nRecounting his campus days, he said it felt uneasy in the initial months in the lecture halls.\n\"Sitting down for lectures for many hours proved very challenging, considering my age. I had pains in my foot and waist from the long hours of sitting.  But after a few months, I adjusted to the system and gradually shrugged them off and moved on,” he added.\nMr Aheto, who was a class teacher in 1966 before relocating to Nsawam, urged all the graduates to concentrate on their life’s endeavour.\n });\nHe advised the younger ones that \"every student who is aspiring to be someone in the future should work hard.\" Whatever you do, do it with resilience and hard work.\nThe acting Vice-Chancellor, Prof Denis Aheto, commended the tenacity and resilience of his father to pursue further studies.\nHe urged the younger ones to eschew the get-rich-quick syndrome and strive to pursue further studies.\n\"Age can never be a limit to education. Old age is about mindset. We need to re-conform as a society,\" he added\n });\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   father MBA UCC \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n Pope accepts Bishop Mante’s resignation, names UCC lecturer to lead Jasikan Diocese \n UCC appeals for financial clearance for recruitment \n ‘No room for egos’: Sam Jonah issues bold challenge to UCC graduates and Ghana’s future leaders \n Rigid school structures make religious freedom ‘very difficult’ – Warns ex-GES Director \n UCC council ends Prof. Boampong’s tenure, revises contract to expire on his 60th birthday \n Invest more in aviation safety to prevent future crashes — Dr. Thomas Ojo \n KNUST dominate 28th GUSA Cross Country and Minor Games \n Freed Israeli hostage forced to dig own grave is ‘growing back to his old self’, father says \n Wode Maya celebrates his late father for inspiring his unplanned career in digital storytelling \n Law Lecturer drags GTEC, UCC to court over VC retirement saga",
    "timestamp": "2025-12-28T06:17:36.579Z",
    "title": "Meet 81-year-old father of UCC Acting Vice-Chancellor, who recently graduated with an MBA"
  },
  {
    "_id": "6950cb75e34a44bda8b79b3b",
    "url": "https://www.myjoyonline.com/family-cremates-wrong-body-after-hospital-mistake-in-scotland/",
    "image": null,
    "text": "Scotland's largest hospital has apologised after a bereaved family was given the wrong body for a cremation ceremony.\n });\nMorgue staff at the Queen Elizabeth University Hospital (QEUH) in Glasgow passed an incorrectly labelled corpse to undertakers.\nThe mistake was only realised after the funeral service and cremation.\nNHS Greater Glasgow and Clyde blamed human error and said that the staff involved had been suspended.\nFirst reported by the Scottish Sun, the family who thought they were cremating their loved one are said to be inconsolable.\n });\nThe mistake also denied another family the chance to have their relative's remains for a funeral.\nDr Scott Davidson, NHS Greater Glasgow and Clyde medical director, said: \"I would like to offer my sincere apologies to both families affected.\n\"We have very rigorous processes for the identification and labelling of bodies from arrival in our mortuaries until their release into the care of an undertaker.\n\"It is of deep regret that these processes have not been adhered to on this occasion, and that as a result two families have been caused significant additional distress at an already very difficult time.\n });\n\"We launched an immediate investigation into this incident and will ensure that learning is applied.\"\n'Deeply concerned'\nThe £840m QEUH campus, which includes the Royal Hospital for Children, was hailed as a world leading facility when it opened in 2015.\nHowever, it has been dogged by infection outbreaks and concerns around the water and ventilation systems.\nSuch issues are being investigated as part of the Scottish Hospitals Inquiry.\n });\nThe Scottish government said it was \"deeply concerned\" by the cremation incident.\nA spokesperson said: \"We wish to express our sincere condolences to the families involved with this terrible incident.\n\"We have been clear with NHS Greater Glasgow and Clyde that they must fully investigate the circumstances.\n\"We will also carefully consider the findings of the senior inspector of burial, cremation and funeral directors into the circumstances.\"\n });\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   Cremation Scotland \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n Scotland qualify for first men’s World Cup in 28 years after Denmark epic \n Accra Indie Filmfest secures British Council grant to expand to Scotland \n Scottish businessman found dead in Kenya \n Scotland agrees to host Commonwealth Games in 2026 \n Hungary snatches 1-0 win over Scotland to leave it with chance of making last 16 at Euro 2024 \n Euro 2024: Scotland hold Switzerland in gritty affair \n Euro 2024: Scotland secure seal qualification with two games to spare \n Queen Elizabeth II’s coffin arrives in Edinburgh, mourners line streets to pay their respects \n Scotland first in world to make period products, including tampons and sanitary pads, free \n Scotland v Ukraine World Cup play-off semi-final rescheduled for June 1",
    "timestamp": "2025-12-28T06:17:58.195Z",
    "title": "Family cremates wrong body after hospital mistake in Scotland"
  },
  {
    "_id": "69533bcb673047ef1a241099",
    "url": "https://www.myjoyonline.com/this-is-an-abuse-of-trust-puwu-tuc-slams-govt-over-ecg-privatisation-plans/",
    "title": "‘This is an abuse of trust’- PUWU-TUC slams gov’t over ECG privatisation plans",
    "text": "The Public Utilities Workers’ Union (PUWU) has strongly criticised government plans to introduce private sector participation in the Electricity Company of Ghana (ECG), describing the move as an “abuse of trust” and a betrayal of earlier agreements reached with organised labour.\n });\nSpeaking in an interview on Joy FM’s Newsnight on Monday, December 29, the General Secretary of PUWU-TUC, Timothy Nyame, questioned the rationale behind pushing for privatisation at a time when ECG, he said, is recording a clear turnaround under its new leadership.\nAccording to Mr Nyame, identifying the problems at ECG was already “about 50 per cent of the solution,” and workers, management, and the board have demonstrated that the company can recover without private investors.\n“You are talking about a company that is turning around, yet you still want to infuse private sector participation,” he said. “Does that mean you do not trust the people who have been appointed as the new directors?” he asked.\nMr Nyame pointed to what he described as measurable improvements at ECG over a short period, crediting the progress to effective leadership and strong collaboration between management and workers.\n });\nHe said ECG is now recording high performance, including improved payments to Independent Power Producers (IPPs) and a reduction in system losses by three percentage points.\n“Yet, despite these gains, there is insistence on private sector participation at all costs,” he added.\nThe PUWU General Secretary expressed skepticism about claims that private sector participation would automatically improve efficiency, arguing that such arrangements often end up burdening citizens.\nMr Nyame said the original agreement with government was meant to demonstrate the capacity of Ghanaians to turn around a struggling state enterprise when given the right direction and support.\n });\n“All the conditions we agreed on were supposed to be adhered to by all parties,” he said.\nHe warned against any attempt to “paint a picture” that ECG must be sold or handed over to private interests, insisting that the company is not an ordinary commercial entity.\n“ECG is not an ordinary company that can simply be divested and handed over to private interests. It is a strategic national asset that concerns all of us,” Mr Nyame stated.\nAccording to him, ECG has capable and experienced staff who can restore the company’s fortunes if properly led, and pushing privatisation now raises questions about government’s confidence in its own appointees.\n });\nMr Nyame suggested that government’s concern may be the pace of the turnaround rather than its direction, but questioned the logic behind that argument.\nDescribing the situation as deeply disappointing, he said PUWU feels government has departed from the spirit and letter of earlier agreements.\n“What is happening amounts to an abuse of trust. We are not happy. What we agreed on with the Minister is not what is being adhered to,” he said.\n });\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   ECG PUWU \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n ECG can be salvaged without private investors -TUC Deputy Secretary-General \n ECG restores electricity credit purchases for MMS-compliant meters \n ECG announces technical challenge with MMS-compliant meters; says it’s being fixed \n Energy sector shortfall persists; to balloon to US$1.10bn in 2026 – IMF \n ECG to be privatised – IMF reveals in Staff Report \n PUWU issues ultimatum over illegal takeover of Ghana Water lands in Ashanti Region \n PUWU threatens industrial action over illegal takeover of Ghana Water Lands in Ashanti region \n ECG and NEDCo performance to face tougher scrutiny in 2026 – Energy Minister \n Utility Service Providers need $320m to cut losses – PURC \n New tariff adjustment ignores macroeconomic reality, says ECG Economist",
    "image": null,
    "timestamp": "2025-12-30T02:41:15.817Z"
  },
  {
    "_id": "69533bcc673047ef1a24109c",
    "url": "https://www.myjoyonline.com/214m-in-gold-for-reserves-programme-not-a-loss-parliaments-economy-chair-insists-its-a-transactional-cost/",
    "title": "$214M in gold-for-reserves programme not a loss, Parliament’s economy chair insists it’s a transactional cost",
    "text": "Eric Afful, Chairperson of Parliament’s Economy Committee, has said the reported $214 million “loss” under the Gold-for-Reserves (G4R) programme should not be classified as a loss but rather as a transactional cost incurred by the Ghana Gold Board (GoldBod). \n });\nHe made the remarks while addressing concerns raised by the Minority in Parliament about the alleged mismanagement of the programme.\nAfful, speaking on Newsnight on Joynews , Monday, December 29, emphasised that the Gold Board has yet to officially release its financial statements.\n“Gold board has not rendered its financials. Though there was information going on to the IMF that there is that $240 million… I’m saying confidence that the $240 million cannot be described as you speak today, as losses. Cannot be described as losses. It is a cost. It is a transactional cost to the gold board,” he said.\nThe comments come amid calls by the Minority in Parliament for a bipartisan investigation into the programme. \n });\nKojo Oppong Nkrumah, MP for Ofoase Ayirebi, told journalists that a parliamentary ad-hoc committee should be empowered to subpoena all contracts, licenses, intermediaries, and related entities. \nHe also urged the Bank of Ghana and GoldBod to disclose fee structures, pricing formulas, and aggregator selection criteria, alongside foreign exchange arrangements connected to the G4R initiative.\nOppong Nkrumah further raised concerns about gold sourced from forest reserves, calling for a suspension of permits in these areas and the introduction of stricter traceability measures. \nThe Minority insists that the inquiry is necessary to ensure accountability, transparency, and that state funds are not linked to illegal mining activities. \n });\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   Goldbod Majority Minority \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n GoldBod CEO accuses Minority of hypocrisy over Gold-for-Reserves losses \n Sammy Gyamfi to address alleged losses under gold for reserves programme on Jan 5 \n BoG–GoldBod $214m hit is design failure, not market loss – Minority \n Minority demands answers on Bawa-Rock Limited monopoly in GoldBod deal \n Minority demands parliamentary probe into BoG-GoldBod $214m loss \n The Cedi Ressurection: Goldbod didn’t promote galamsey to strengthen it \n Source of GOLDBOD’s trading funds questioned amid reported $214m loss \n Come again, Bank of Ghana! \n Does Goldbod owe BoG US$214m, or has BoG lost US$214m? A policy and financial risk analysis \n GOLDBOD CEO explains ‘Clear Typo’ in Foreign Reserves claim",
    "image": null,
    "timestamp": "2025-12-30T02:41:16.329Z"
  },
  {
    "_id": "69533bd1673047ef1a24109f",
    "url": "https://www.myjoyonline.com/festive-season-sees-minor-fires-but-domestic-cases-hit-15-20-daily-gnfs/",
    "title": "Festive season sees minor fires, but domestic cases hit 15–20 daily – GNFS",
    "text": "The Ghana National Fire Service (GNFS) says it is responding to an average of 15 to 20 fire outbreaks every day in the Greater Accra Region, with most incidents linked to domestic fires, despite recording only minor cases during the ongoing festive season.\n });\nSpeaking on Pulse on JoyNews, Greater Accra Regional Officer of the GNFS, ACFO II Rashid Kwame Nisawu, said residential communities account for the bulk of the daily fire incidents attended to by the Service. \n“As for domestic fires, within a day, if I’m not exaggerating, we can get like 20 cases — between 15 to 20 every day,” he stated.\nACFO II Nisawu explained that many of the fires occur in homes and densely populated areas, including informal settlements, increasing the risk to lives and property. He also identified faulty electricity infrastructure as a recurring cause of some fire outbreaks. \n“Some of them are these ECG poles, the wooden ones. Sometimes they catch fire, they call us and we come to extinguish them,” he noted.\n });\nThe disclosure comes on the back of the GNFS’ public safety campaign dubbed “Paint Accra Red,” aimed at intensifying fire prevention awareness, particularly during the festive season when the use of electrical appliances, fireworks and cooking equipment increases. \nAlthough the Service says the current festive period has recorded mostly minor fires, officials warn that complacency could lead to major incidents.\nThe Fire Service has therefore urged residents to observe basic fire safety measures, including proper handling of electrical appliances, avoiding illegal power connections and reporting fire hazards promptly. The GNFS says sustained public education and community cooperation remain critical to reducing the high number of daily domestic fire incidents in the capital.\n });\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   Festive Season Fire Outbreaks Fire Service \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n Fire Service rescues two in truck accident at Asukawkaw \n AMA to maintain toll collection and 24-hour sanitation drive during festive season \n Accra regional police urge vigilance ahead of the festive season \n Breaking up before the holidays: Is it better to let go before or after the festive season? \n GNFS to launch nationwide vehicle fire-extinguisher compliance drive \n Fire outbreaks decline by 13% in Ashanti Region between 2024 and 2025 \n Security agencies storm Accra in massive ‘Show of Force’ exercise ahead of festive season \n Fire Service offers reward after firefighter stabbed during Adjiringanor fire outbreak \n St. Paul’s Lutheran School extends support to Mampong School for the Deaf ahead of festive season \n Most victims of Roman Ridge building collapse discharged – Fire Service",
    "image": null,
    "timestamp": "2025-12-30T02:41:21.289Z"
  },
  {
    "_id": "69533bf2673047ef1a2410a2",
    "url": "https://www.myjoyonline.com/2025-in-review-fire-power-and-the-weight-of-return-january-march/",
    "title": "2025 in Review: Fire, power and the weight of return (January – March)",
    "text": "Ghana entered 2025 under the weight of crisis, transition and unresolved tensions, as a devastating fire at Kantamanto Market, the return of John Mahama to the presidency, and renewed clashes over illegal mining shaped the national mood in the first three months of the year.\n });\nJanuary: Smoke, Swearing-In, and Unfinished Business\nThe year began in flames.\nAt dawn on January 1, a massive fire tore through Kantamanto Market, reducing decades of work to ash within hours. Thousands of traders watched their livelihoods vanish, once again exposing the fragility of Ghana’s informal economy and the high cost of congestion, neglect, and weak enforcement.\nRead: Traders count losses as fire destroys over 100 shops at Kantamanto market\n });\nThe disaster was more than a fire. It was a reminder that for many Ghanaians, survival remains provisional, rebuilt after every setback but rarely protected by policy.\nJust days later, the country turned from smoke to ceremony. On January 7, John Dramani Mahama was sworn in for a second term as President, returning to office amid economic fatigue and public scepticism. \nHis comeback carried the weight of familiarity rather than novelty — a leader returning not to introduce himself, but to confront unfinished business.\nThe promise of a reset, however, was quickly unsettled.\n });\nIn Obuasi, the fatal shooting of suspected illegal miners by military personnel at the AngloGold Ashanti concession reignited national anger over the state’s handling of galamsey. \nThe incident reopened long-standing questions about force, accountability, and the livelihoods tied to mining, reminding the nation that natural resource governance remains one of Ghana’s most combustible fault lines.\nThe highlight of January was President Mahama announcing his ministerial nominees in batches starting January 9, 2025, submitting the first set to Parliament, with subsequent lists following, including regional ministers around January 16 and a near-complete list submitted by January 20-21, 2025, fulfilling his pledge to name a full cabinet within 14 days of his January 7, 2025, swearing-in. \nRead: Mahama to announce final ministerial list on January 20\n });\nThe vetting process for the first set of ministerial nominees presented by the president began on January 13. Of course, this was not without drama. \nRead: Vetting of ministerial nominees begins today\nThe Appointments Committee descended into chaos on January 30, as tensions flared between the Minority and Majority members, culminating in a heated confrontation.\nRead: Chaos erupts at Appointments Committee as Minority and Majority clash\n });\nThe clash escalated to the point where tables and microphones were destroyed, prompting the intervention of the police to restore order and prevent further destruction.\nRead: Speaker sets up Special Committee to probe vetting chaos\nSpeaker of Parliament, Alban Bagbin, established a special committee to investigate the chaos that erupted in Parliament during the vetting of ministerial nominees.\nThe seven-member committee, chaired by Ho West MP Emmanuel Bedzrah, was tasked with identifying those responsible for the disruptions and recommending appropriate actions.\n });\nFebruary: Power, Pressure and Public Trust\nAs the political dust settled, attention shifted to the state's authority and the limits of its power. \nPublic debate intensified around security operations, environmental protection, and whether enforcement without economic alternatives could ever deliver lasting solutions.\nTrust remained thin. For many citizens, the early weeks of the new administration felt less like a break from the past and more like a continuation of unresolved tensions — between law and livelihood, control and compassion.\n });\nPresident John Mahama directed the Ministry of Finance to settle outstanding Domestic Debt Exchange Programme (DDEP) coupons and build a financial buffer through the Sinking Fund.\nRead: DDEP: Finance Ministry pays GH₵6bn to bondholders\nThe president delivered his first State of the Nation Address (SONA) for his second term to Parliament, outlining the nation's challenges, his administration's achievements, and policy directions, including economic recovery plans and measures to tackle debt. \nRead: Full text: Mahama’s first SONA in second term delivered to Parliament on Feb. 27\n });\nMarch: Gold, Control and Economic Nerve\nBy March, government signalled a firmer economic stance. Parliament passed the GoldBod Bill, a move aimed at centralising gold trading and clamping down on illicit exports that have long drained state revenue.\nRead: Parliament passes Ghana Gold Board Bill 2025\nThe legislation reframed gold from mere mineral wealth into an instrument of state authority. It was a declaration that economic recovery would require tighter control, even at the risk of resistance.\nIn the first quarter of 2025, fire exposed vulnerability, power tested legitimacy, and gold became a battleground for control. The tone was set early: this would be a year defined not by ease, but by hard choices.\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   2025 in Review Kantamanto market President John Mahama \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n Mahama enjoys 67% approval as majority of Ghanaians express optimism – Global InfoAnalytics \n Mahama pledges reset, growth and jobs for all Ghanaians in Christmas message \n Ghana to push UN motion declaring slave trade humanity’s greatest crime \n Debt cancellation, cash and stolen artefacts -Mahama demands real reparations for Africa \n Africans cannot afford discriminative tagging – Mahama at Diaspora Summit \n Constitutional Review Committee proposes 5-year presidential term \n President Mahama pushes reparations, calls for united African front at diaspora summit \n Mahama directs upgrade of Ho and Hohoe from Municipal to Metropolitan status \n President Mahama deploys Ghana Armed Forces to aid Jamaica after hurricane \n Asantehene is a national asset – Mahama commends Otumfuo’s role in Bawku peace process",
    "image": null,
    "timestamp": "2025-12-30T02:41:54.697Z"
  },
  {
    "_id": "69533bf7673047ef1a2410a6",
    "url": "https://www.myjoyonline.com/bog-goldbod-214m-hit-is-design-failure-not-market-loss-minority/",
    "title": "BoG–GoldBod $214m hit is design failure, not market loss – Minority",
    "text": "The Minority in Parliament has described the reported $214 million loss incurred by the Bank of Ghana (BoG) under the Gold-for-Reserves programme as a deliberate design failure, rather than the result of market fluctuations.\n });\nAddressing a press briefing on Monday, the Ofoase Ayirebi MP, Kojo Oppong Nkrumah, said the losses, as cited by the International Monetary Fund (IMF) in its programme review, expose deep structural flaws in the current GoldBod-led implementation of the initiative.\n\"This is not a 'market fluctuation problem'. It is a system design that forces the State to bleed so intermediaries remain secure,\"' he noted\nThe Ranking Member on the Economy and Development Committee said GoldBod is compelled to buy gold from small-scale miners at real global market prices and at exchange rates comparable to those offered by forex bureaus, to remain competitive.\nHowever, after selling the gold offshore and receiving dollar proceeds, GoldBod reportedly converts the foreign exchange back to the Bank of Ghana at the BoG or interbank rate, which is typically weaker than the market rate. The resulting exchange-rate gap, the Minority explained, is then absorbed by the central bank. \n });\n“In effect, GoldBod protects its own books by passing the FX losses directly onto the Bank of Ghana,” the caucus said.\nThey insisted this mechanism is built into the system and cannot be blamed on volatility or external shocks.\nWhile acknowledging the IMF’s $214 million loss estimate over nine months of 2025, the Minority said the figure does not fully capture the true cost of the programme. The caucus warned that as long as the structure remains unchanged, losses will continue to accumulate, regardless of gold prices or export volumes.\n“This model forces the State to bleed so that intermediaries remain secure,” the Minority stated.\n });\nAlso,the Minority warned that the $214 million loss represents foregone development opportunities, including hospitals, water systems, and other critical social infrastructure.\nThe concerns come amid controversy surrounding an International Monetary Fund (IMF) report, which disclosed that Ghana recorded losses estimated at about US$214 million under the Bank of Ghana’s Gold-for-Reserves programme, a development the Fund described as a potential risk to the country’s economic stability.\nHowever, GoldBod has rejected the claims in the report, insisting it has not recorded any losses and is on course to post a surplus of at least GH¢600 million in the 2025 financial year.\n });\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   Goldbod Minority \n Advertisement \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n $214M in gold-for-reserves programme not a loss, Parliament’s economy chair insists it’s a transactional cost \n GoldBod CEO accuses Minority of hypocrisy over Gold-for-Reserves losses \n Sammy Gyamfi to address alleged losses under gold for reserves programme on Jan 5 \n Minority demands answers on Bawa-Rock Limited monopoly in GoldBod deal \n Minority demands parliamentary probe into BoG-GoldBod $214m loss \n The Cedi Ressurection: Goldbod didn’t promote galamsey to strengthen it \n Source of GOLDBOD’s trading funds questioned amid reported $214m loss \n Come again, Bank of Ghana! \n Does Goldbod owe BoG US$214m, or has BoG lost US$214m? A policy and financial risk analysis \n GOLDBOD CEO explains ‘Clear Typo’ in Foreign Reserves claim",
    "image": null,
    "timestamp": "2025-12-30T02:41:59.531Z"
  },
  {
    "_id": "69533bf8673047ef1a2410a9",
    "url": "https://www.myjoyonline.com/three-suspects-gunned-down-as-police-foil-robbery-on-anwiankwantaobuasi-highway/",
    "title": "Three suspects gunned down as police foil robbery on Anwiankwanta–Obuasi Highway",
    "text": "The Ashanti South Regional Police Command has gunned down three suspected armed robbers to prevent a planned highway robbery along the Anwiankwanta–Obuasi Highway in the Ashanti Region.\n });\nThe suspects, identified as Seidu Issah, Musah Yakubu, and Yahaya Munkaila, also known as Tijani, were gunned down on 24th December 2025 when they converged in a bush between Anwiankwanta and the Jacobu junction to carry out a planned operation.\nThe officers encountered the gang, came under gunfire, and returned fire, gunning down the three suspects while two others escaped.\nPolice retrieved two pump-action guns loaded with ammunition, one unbranded pistol, twenty-five live cartridges, and six spent cartridges from the scene. The suspects were rushed to Bekwai Municipal Hospital, where they were pronounced dead on arrival, and their bodies were deposited at the hospital morgue for preservation and autopsy.\nThe suspects are believed to be behind several robberies including the Jacobu airport robbery on 3rd November 2025, which led to the death of a security man, multiple highway robberies along the Manso stretch, the Antoakrom robbery, the Abofour forest robbery near Offinso, and the attack on a gold buyer at Anwiankwanta on 8th December 2025.\n });\nIn a follow-up operation on 26th December 2025 at a palm plantation near Manso Nkwanta where the suspects usually hide rifles, police recovered one AK47 assault rifle, one MG3 rifle, one pump action gun, and one single-barreled gun, together with ammunition and personal items.\nStrenuous efforts are underway to trace the sources of the weapons and arrest accomplices currently at large.\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   Anwiankwanta–Obuasi Highway obbery Police \n Advertisement \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n Police take over Gomoa Nyanyano after two factions clash in chieftaincy dispute \n Police net 120 suspects in major East Legon drug and crime swoop \n Three suspected armed robbers shot dead by Police in Ashanti region \n Police arrest 28-year-old with 98 parcels of suspected cannabis in Tamale \n Police arrest suspect for theft during Diaspora Summit 2025 in Accra \n Police arrest suspect involved in robbery of delivery rider at Tantra Hill \n Police foil suspected robbery at Ashaiman; 3 suspects killed \n 41 arrested in targeted police operations across Eastern Region \n Police arrest three individuals for impersonating public officials and online fraud \n Two arrested for unlawful possession of firearm, ammunition",
    "image": null,
    "timestamp": "2025-12-30T02:42:00.032Z"
  },
  {
    "_id": "69533bf8673047ef1a2410ab",
    "url": "https://www.myjoyonline.com/tor-requires-massive-capital-injection-to-compete-with-newer-more-advanced-refineries-copec/",
    "title": "TOR requires massive capital injection to compete with newer, more advanced refineries – COPEC",
    "text": "The Executive Secretary of the Chamber of Petroleum Consumers (COPEC), Duncan Amoah, has said the resumption of operations at the Tema Oil Refinery (TOR), while commendable, represents only the first of three critical phases required to make the refinery economically viable and environmentally compliant.\n });\nAcknowledging that the successful turnaround maintenance (TAM) had helped dispel a long-standing perception that the refinery was too old to function effectively, Mr Amoah cautioned that the current phase alone was insufficient to sustain operations or meet Ghana’s modern fuel standards. \n“The integrity of the plant has been proven. TOR is not as obsolete as some had suggested,” he said, noting that the refinery could still play a vital role in Ghana’s energy security if the right investments are made.\nSpeaking on TV3's morning programme on Monday, December 29, 2025, monitored by Graphic Online, Mr Amoah explained that Ghana has, since 2015–2016, most vehicles in Ghana have transitioned away from high-sulphur “dirty fuels” and now require cleaner fuels, which burn more efficiently and significantly reduce environmental pollution to help meet Euro IV and Euro V specifications, with a sulphur content ranging between 10 and 50 parts per million (ppm).\nHe said TOR’s existing Crude Distillation Unit (CDU) and Residual Fluid Catalytic Cracking (RFCC) units were only capable of producing fuels with sulphur levels of about 1,500 ppm at best. \n });\nThis, according to COPEC, falls far below Ghana’s current fuel standards and poses serious environmental and public health risks.\nWhenever TOR resumed operations, he said a large portion of its output had to be exported to neighbouring Sahelian countries because the local automotive fleet could not safely consume such high-sulphur products. \nIn addition, he stated that a reformer unit, costing between US$25 million and US$50 million, would be required to improve petrol quality and meet Ghana’s minimum 91-octane requirement.\nTo address this challenge, Mr Amoah said TOR would require major upgrades, including the installation of a desulphurisation unit, estimated to cost about US$150 million, to reduce sulphur content in refined products.\n });\nIn addition, he stated that a reformer unit, costing between US$25 million and US$50 million, would be required to improve petrol quality and meet Ghana’s minimum 91-octane requirement.\nHe warned that without these investments, TOR would struggle to compete with newer and more advanced refineries such as Nigeria’s Dangote Refinery and other regional facilities.\nMr Amoah also stressed the need for TOR to be run strictly as an economic entity, free from political interference.\nHe argued that political decisions, rather than economic considerations, have historically undermined the refinery’s performance.\n });\n“For sustainability, private sector participation is critical,” he said, advocating for a public-private partnership (PPP) model. \nHe said private investors would ensure efficiency, control operational costs, and make decisions based on commercial viability rather than politics.\nOn the broader economic impact, Mr Amoah said Ghana currently spends about US$400 million every month in foreign exchange to import finished petroleum products.\nInvesting in TOR, he argued, would help reduce this burden while retaining skilled labour and strengthening the local economy.\n });\nHe recalled that at its peak in the late 1990s, TOR contributed about five per cent of Ghana’s Gross Domestic Product (GDP), demonstrating the refinery’s potential if properly retooled and managed.\nMr Amoah said TOR was currently doing about 28,000 barrels per stream day, with a plan to scale up the capacity to 45,000 barrels. It has a historical peak of 60,000 barrels per day and Ghana’s daily petroleum demand, he said, is about 100,000 barrels.\n“If TOR can supply even half of national demand, supported by other local refineries, Ghana can significantly reduce its dependence on imported fuel,” he said.\nWhile commending TOR’s management for restarting operations, Mr Amoah maintained that sustained investment and long-term planning are essential if the refinery was to fully support Ghana’s energy security and economic development.\n });\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   Duncan Amoah Petroleum Consumers Tema Oil Refinery \n Advertisement \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n Black market arrests trigger rate volatility, COPEC reveals \n Crackdown on black market dealers hurting forex market – COPEC’s Duncan Amoah \n Reviving Tema Oil Refinery: CEMSE backs tolling model as best path \n Tema Oil Refinery participates in 2025 Ghana-China Business Summit \n Use innovative ways to clear power sector debt, not GH₵1 fuel levy – COPEC to gov’t \n Energy sector woes can’t be fixed through new taxes – Duncan Amoah \n Tema Oil Refinery junior staff appeal for support to revive refinery \n Sentuo Group invests $980m in Tema refinery \n COPEC blames fuel price increases on adjustment in UPPF margin \n ‘There is no takeover by Sentuo Oil Refinery Ltd’ – TOR denies sale claims",
    "image": null,
    "timestamp": "2025-12-30T02:42:00.105Z"
  },
  {
    "_id": "69533c1a673047ef1a2410ae",
    "url": "https://www.myjoyonline.com/volta-regional-minister-urges-unity-respect-for-chief-imams-ruling-after-ho-central-mosque-shooting/",
    "title": "Volta Regional Minister urges unity, respect for Chief Imam’s ruling after Ho central mosque shooting",
    "text": "Volta Regional Minister James Gunu has called for calm and reconciliation following the shooting incident at the Ho Central Mosque on Friday, December 26, which left at least 10 people injured, two in critical condition. \n });\nSpeaking on JoyNews’ Newsnight, he said the regional security council has engaged both factions involved in the dispute, urging them to give peace a chance.\n“The regional security council met with both factions this morning, and we caution them and edge them to give peace a chance. What happened at the genesis of this clash is something that should not have happened at all,” Mr Gunu stated.\nThe minister explained that the crisis stems from a long-standing dispute over the Volta Regional Imamship. He noted that his predecessor had been addressing the issue and that he himself wrote to the National Chief Imam on August 9, 2022, and again upon assuming office on April 29, 2025, seeking intervention to clarify the legitimate Regional Imam.\nOn November 1, 2025, the National Chief Imam visited Ho, met with traditional authorities and members of the Muslim community, and officially declared Sheikh Muniru Ali Mohammed as the Volta Regional Imam. \n });\nMr Gunu emphasised that this declaration aimed to resolve the protracted dispute.\nThe December 26 attack reportedly involved about five masked assailants who opened fire inside the mosque, creating panic among worshippers. Authorities are investigating the incident, which has been linked to the ongoing Imamship disagreement.\nMr Gunu appealed to all parties and their supporters to respect the National Chief Imam’s decision and pursue peace: “This is a legacy issue, and it is time for unity, cooperation, and law-abiding conduct in service to the Muslim community.”\n });\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   Chief Imam Volta Region \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n Sheikh Ali Muniru remains Volta regional Imam, says National chief Imam \n Volta Regional House of Chiefs renew call on Immigration to remove inland barriers at Sogakope, Asikuma \n Volta Regional Minister assures residents of crime-free yuletide \n NPP’s Irene Naa Torshie rallies Volta Region delegates behind Kennedy Agyapong \n Afeku urges creation of world-class hospitality training school in Volta Region \n Afeku calls for major tourism investment in Volta Region to drive jobs and growth \n Housing remains central to my reset agenda – Mahama \n Low condom use among young people in Volta Region disheartening – AIDS Commission \n Cocoa smuggling fueled by delayed payment by COCOBOD – Farmers \n Fire destroys two-bedroom apartment at Tsito–Awudome Gborkorpe",
    "image": null,
    "timestamp": "2025-12-30T02:42:34.018Z"
  },
  {
    "_id": "69533c1b673047ef1a2410b1",
    "url": "https://www.myjoyonline.com/ecg-can-be-salvaged-without-private-investors-tuc-deputy-secretary-general/",
    "title": "ECG can be salvaged without private investors -TUC Deputy Secretary-General",
    "text": "The Deputy Secretary-General of the Trade Union Congress (TUC), Dr Kwabenya Nyarko, has rejected claims that private or foreign capital is necessary to revive the Electricity Company of Ghana (ECG).\n });\nHe insists that workers, in partnership with government, can turn the company around without privatisation.\nThis follows a disclosure by the International Monetary Fund (IMF) that the ECG is expected to be taken over by a private sector operator as part of ongoing reforms in the country’s energy sector.\nSpeaking on JoyNews’ The Pulse on Monday, December 29, he revealed that workers of the Public Utilities Workers’ Union (PUWU) and ECG are prepared to “go the extra mile” to rescue the power distributor, describing ongoing efforts as only the beginning.\nAccording to him, recent collaboration between workers and government has already yielded significant revenue gains within a short period, demonstrating ECG’s potential to recover without private sector participation.\n });\n“If in five months, by working together as a team with government, we have been able to raise revenue to such a significant level, then it means we have shown that we can do it,” he stated.\nDr Nyarko assured that labour unions are ready to adopt additional measures, alongside government, to salvage ECG and preserve it as a strategic national asset, stressing that privatisation is neither inevitable nor necessary.\n“There are other measures that government and workers must take, and we will do our part to ensure ECG does not require any private sector involvement,” he added.\n Dr Nyarko said the argument that foreign investors bring much-needed capital has repeatedly been used to push Ghana into privatisation deals that ultimately fail to deliver on their promises.\n });\nHe cited the privatisation of Ghana Telecom, which later became Vodafone and now Telecel, as a clear example. According to him, the deal was sold to Ghanaians on assurances of fresh capital injection, technology transfer, and job creation, but instead resulted in the loss of about 4,000 jobs.\n“In this country, we have too many examples of private foreign companies coming with promises to invest, but at the end of the day, they come up with nothing,” he said.\nDr Nyarko argued that such promises often serve as bait to force the country into privatisation, while the expected capital injections “never materialise.”\n });\n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Tags:   Dr Kwabenya Nyarko ECG TUC \n DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n Related to this story\n ‘This is an abuse of trust’- PUWU-TUC slams gov’t over ECG privatisation plans \n ECG restores electricity credit purchases for MMS-compliant meters \n ECG announces technical challenge with MMS-compliant meters; says it’s being fixed \n Energy sector shortfall persists; to balloon to US$1.10bn in 2026 – IMF \n ECG to be privatised – IMF reveals in Staff Report \n ECG and NEDCo performance to face tougher scrutiny in 2026 – Energy Minister \n Utility Service Providers need $320m to cut losses – PURC \n New tariff adjustment ignores macroeconomic reality, says ECG Economist \n TUC slams PURC over ‘premature’ and ‘disrespectful’ tariff announcement \n We’ll resist any tariff increase that will erode the meagre 9% wage adjustment – TUC",
    "image": null,
    "timestamp": "2025-12-30T02:42:35.394Z"
  },
  {
    "_id": "69534a5d732c1ea73012ab14",
    "url": "https://www.graphic.com.gh/news/general-news/tor-requires-massive-capital-injection-to-compete-with-newer-and-more-advanced-refineries-copecs-duncan-amoah.html",
    "title": "TOR requires massive capital injection to compete with newer and more advanced refineries – COPEC’s Duncan Amoah",
    "text": "The Executive Secretary of the Chamber of Petroleum Consumers (COPEC), Duncan Amoah, has said the resumption of operations at the Tema Oil Refinery (TOR), while commendable, represents only the first of three critical phases required to make the refinery economically viable and environmentally compliant. Read also: TOR resumes crude oil refining operations with about 28,000 barrels per stream daily Acknowledging that the successful turnaround maintenance (TAM) had helped dispel a long-standing perception that the refinery was too old to function effectively, Mr Amoah cautioned that the current phase alone was insufficient to sustain operations or meet Ghana’s modern fuel standards. “The integrity of the plant has been proven. TOR is not as obsolete as some had suggested,” he said, noting that the refinery could still play a vital role in Ghana’s energy security if the right investments are made. Speaking on TV3's morning programme on Monday [December 29, 2025] monitored by Graphic Online, Mr Amoah explained that Ghana has, since 2015–2016, most vehicles in Ghana have transitioned away from high-sulphur “dirty fuels” and now require cleaner fuels, which burn more efficiently and significantly reduce environmental pollution to help meet Euro IV and Euro V specifications, with a sulphur content ranging between 10 and 50 parts per million (ppm). He said TOR’s existing Crude Distillation Unit (CDU) and Residual Fluid Catalytic Cracking (RFCC) units were only capable of producing fuels with sulphur levels of about 1,500 ppm at best. This, according to COPEC, falls far below Ghana’s current fuel standards and poses serious environmental and public health risks. Whenever TOR resumed operations, he said a large portion of its output had to be exported to neighbouring Sahelian countries because the local automotive fleet could not safely consume such high-sulphur products. TOR would therefore require major upgrades, including the installation of a desulphurisation unit, estimated to cost about US$150 million, to reduce sulphur content in refined products, he added. In addition, he stated that a reformer unit, costing between US$25 million and US$50 million, would be required to improve petrol quality and meet Ghana’s minimum 91-octane requirement. To address this challenge, Mr Amoah said TOR would require major upgrades, including the installation of a desulphurisation unit, estimated to cost about US$150 million, to reduce sulphur content in refined products. In addition, he stated that a reformer unit, costing between US$25 million and US$50 million, would be required to improve petrol quality and meet Ghana’s minimum 91-octane requirement. He warned that without these investments, TOR would struggle to compete with newer and more advanced refineries such as Nigeria’s Dangote Refinery and other regional facilities. Mr Amoah also stressed the need for TOR to be run strictly as an economic entity, free from political interference. He argued that political decisions, rather than economic considerations, have historically undermined the refinery’s performance. “For sustainability, private sector participation is critical,” he said, advocating for a public-private partnership (PPP) model. He said private investors would ensure efficiency, control operational costs, and make decisions based on commercial viability rather than politics. On the broader economic impact, Mr Amoah said Ghana currently spends about US$400 million every month in foreign exchange to import finished petroleum products. Investing in TOR, he argued, would help reduce this burden while retaining skilled labour and strengthening the local economy. He recalled that at its peak in the late 1990s, TOR contributed about five percent of Ghana’s Gross Domestic Product (GDP), demonstrating the refinery’s potential if properly retooled and managed. Mr Amoah said TOR was currently doing about 28,000 barrels per stream day, with a plan to scale up the capacity to 45,000 barrels. It has a historical peak of 60,000 barrels per day and Ghana’s daily petroleum demand, he said, is about 100,000 barrels. “If TOR can supply even half of national demand, supported by other local refineries, Ghana can significantly reduce its dependence on imported fuel,” he said. While commending TOR’s management for restarting operations, Mr Amoah maintained that sustained investment and long-term planning are essential if the refinery was to fully support Ghana’s energy security and economic development.",
    "image": "https://www.graphic.com.gh/images/2025/dec/27/tor1.jpg",
    "timestamp": "2025-12-30T03:43:25.721Z"
  },
  {
    "_id": "69534a5e732c1ea73012ab16",
    "url": "https://www.graphic.com.gh/news/general-news/ho-mosque-shooting-incident-police-release-14-suspects-from-custody.html",
    "title": "Ho mosque shooting incident: Police release 14 suspects from custody",
    "text": "The Office of the Volta Regional Chief Imam, Alhaji Ali Muniru has condemned the Boxing Day shooting incident at the Ho Central Mosque by a group of assailants, saying it violated the sanctity of the house of worship and left innocent worshippers injured. In a statement dated December 27, 2025, issued by the office and signed by the spokesman for the Regional Chief Imam, Chief Adamu Hamani, he said the tragic incident was the outcome of the deliberate and prolonged obstruction to the lawful authority of the Volta Regional Chief Imam, despite his recent affirmation by the National Chief Imam, Sheik Osman Nuhu Shaributu, by a faction at the Sabong Zango. In an open defiance, the faction at the Zango had persistently prevented the Regional Chief Imam from accessing the Ho Central Mosque by resorting to threats, intimidation, and violence, rather than lawful or acceptable Islamic processes, the statement added. He said the repeated appeals to the Volta Regional Police Command to ensure Alhaji Muniru’s safe and lawful access to the mosque were ignored. “More troubling is the repeated claims by the faction that they were supported by the the Regional Police Command and other security agencies,” the statement added. Further, the statement said, the conduct of the security agencies after the shooting incident was rather disturbing. For instance, it said, despite the numerous videos circulating on social media and other irrefutable evidence vividly showing family members and supporters of the Regional Chief Imam being violently attacked, the Regional Police Command ignored them. “Rather, the police arrested people perceived to be aligned to the Regional Chief Imam, while turning a blind eye to the atrocities committed against him, his family, and his supporters,” the statement claimed. As a result, the statement said, fear had heightened at the Zango, had compelling some individuals to flee for their lives. “Even more alarming, the Ho Central Mosque, declared a crime scene, was swiftly reopened and made available to the faction, severely undermining public the confidence in the neutrality of the security agencies response,” it said. The statement called for a professional, impartial, and courageous action from the security agencies to protect lives and property at the Zango. It entreated all Muslims in the region to remain calm, law-abiding and steadfast in peace, even in the face of provocation. When contacted, the Volta Regional Police Commander, DCOP Wisdom Akorli said the preliminary investigation had, so far, revealed that the incident was premediated. He said meticulous investigations were still ongoing into the matter, adding the police would not take sides in the matter. The Regional Police Commander said although calm had returned to the Zango, the police would remain present there for some time to ensure the peace was not violated by any group. Graphic Online understands all the 14 suspects who were sent to the Police Headquarters in Accra on Saturday for interrogation, have been released.",
    "image": "https://www.graphic.com.gh/images/2025/dec/26/ho2.jpg",
    "timestamp": "2025-12-30T03:43:25.747Z"
  },
  {
    "_id": "69534a60732c1ea73012ab19",
    "url": "https://www.graphic.com.gh/news/education/no-category-a-shs-in-3-newly-created-regions.html",
    "title": "No category ‘A’ SHS in 3 newly created regions",
    "text": "There is no category ‘A’ senior high school (SHS) in three of the six newly created regions. They are the North East, Savannah and Oti regions, the Minister of Education Haruna Iddrisu has said. He has, therefore, appealed to traditional leaders in the affected regions to play a crucial roles in partnership with the government to address the situation. Mr Iddrisu said this at the inauguration of the governing councils of four colleges of education in Accra. The colleges are the Enchi College of Education with Dr Frank Kwekucher Acker as Council Chairman; Al-Faruq College at Wenchi with Yapeiwura A.B.T. Zakaria as Chairman and Gbewaa College of Education at Pusiga with Prof Imoro Braimah as Council Chairman; and the Agogo Presbyterian Women’s College of Education with Rev Prof Seth Asare-Danso as Chairman. Mr Iddrisu explained that it was to address the issue of equity and inclusivity that he announced publicly the decision to convert 30 category ‘C’ schools to ‘B’ and 10 category ‘B’ schools to category ‘A’. The minister further announced that the ministry intended to expand infrastructure in all the category A schools. Mr Iddrisu hinted that for the Savannah, he intended to elevate the Damongo Girls’ SHS to a category ‘A’ school, but added that, “I will walk through the process in order that I do not compromise quality for a declaration of a category ‘A’ school.” The minister gave the assurance that the school would receive some support to befit its new status as a category ‘A’ school, adding that the Domongo SHS would equality receive attemtion.",
    "image": "https://www.graphic.com.gh/images/2025/dec/28/haruna_iddrisu.jpg",
    "timestamp": "2025-12-30T03:43:28.202Z"
  },
  {
    "_id": "69534a60732c1ea73012ab1c",
    "url": "https://www.graphic.com.gh/news/general-news/nacoc-cracks-down-on-festive-illicit-drug-trade-arrests-72-across-two-regions.html",
    "title": "NACOC cracks down on festive illicit drug trade, arrests 72 across two regions",
    "text": "The Narcotics Control Commission (NACOC) has carried out a series of intelligence-led operations across the Eastern and Greater Accra regions, dismantling several drug dens as part of a festive season crackdown dubbed Operation White Ember. On Boxing Day, NACOC officers extended the operation to Tema Community One and Teshie Nungua, where dozens of suspects were arrested and quantities of illicit drugs were seized, with support from the Commission’s K9 unit. Patrols were also conducted at major shopping malls and along popular beaches in the capital as part of efforts to curb drug-related activities during the holiday period. In all, 72 suspects were arrested during the operations, with exhibits recovered including ecstasy, methamphetamine and cannabis laced alcoholic beverages. Beyond the arrests and seizures, NACOC highlighted the wider social impact of the exercise, noting that the drugs intercepted potentially represent “thousands of lives saved from the brink of addiction” during the festive season. Officers also engaged residents in affected communities, many of whom gathered to cheer the removal of suspected drug peddlers from their neighbourhoods. As part of the operation, NACOC conducted on-site public education, sensitising residents on the dangers of drug abuse and the impact of narcotics on community safety. The Commission reiterated its commitment to sustaining the momentum of Operation White Ember, assuring the public that similar raids would continue in the days and months ahead to ensure that the festive season and beyond remain a time of safety, joy and wellbeing for all Ghanaians.",
    "image": "https://www.graphic.com.gh/images/2025/dec/28/nacoca.jpg",
    "timestamp": "2025-12-30T03:43:28.621Z"
  },
  {
    "_id": "69534a62732c1ea73012ab1f",
    "url": "https://www.graphic.com.gh/news/general-news/canadian-woman-ghanaian-boyfriend-arrested-for-allegedly-burning-down-oyarifa-apartment.html",
    "title": "Canadian woman, Ghanaian boyfriend arrested for allegedly burning down Oyarifa apartment",
    "text": "The Criminal Investigation Department (CID) of the Ghana Police Service has announced the arrest of two individuals, including a Canadian national, for allegedly causing extensive unlawful damage at a residence in Oyarifa. In a press release dated December 27, 2025, the Service stated that \"the Greater Accra Regional Police Command has arrested two suspects in connection with a case of causing unlawful damage at Oyarifa Anointed Down in the Greater Accra Region.\" The suspects were identified as Jennifer Mae Tomlinson, a Canadian, and her Ghanaian boyfriend, Mohammed Issah. They were arrested on December 23, 2025 and December 25, 2025, respectively. According to the police, the arrests followed \"investigations into an arson incident at the apartment.\" Preliminary police findings point to a deliberate act. \"Preliminary investigations suggest that the suspects, who were tenants occupying the apartment, deliberately set the property ablaze on 23rd December 2025, completely destroying it without any apparent provocation,\" the release detailed. The sequence of arrests saw Mohammed Issah apprehended first. \"Suspect Mohammed Issah was arrested by the Ayimensah Abokobi Police on the same day the incident occurred,\" the statement explained. His alleged accomplice, Jennifer Mae Tomlinson, initially evaded capture. She \"went into hiding and was later arrested from her hideout on 25 December 2025.\" Both individuals are now in custody as inquiries continue. The CID confirmed that \"both suspects are currently in police custody assisting investigations, and they will be put before the court to face charges in accordance with the law.\" The press release was signed by Chief Inspector Brigitte Babanawo, the Public Relations Officer for the Criminal Investigation Department.",
    "image": "https://www.graphic.com.gh/images/2025/dec/25/arson25.jpg",
    "timestamp": "2025-12-30T03:43:30.390Z"
  },
  {
    "_id": "69534a62732c1ea73012ab22",
    "url": "https://www.graphic.com.gh/news/general-news/latvia-responds-to-ghanas-request-over-death-of-ghanaian-student.html",
    "title": "Latvia responds to Ghana’s request over death of Ghanaian student",
    "text": "The Minister of Foreign Affairs, Samuel Okudzeto Ablakwa, has disclosed that the Latvian Ministry of Foreign Affairs has formally responded to Ghana’s request for information regarding investigations into the tragic death of a Ghanaian student, Nana Agyei, in Latvia. The development follows reports, including a widely circulated video, alleging the killing of a Ghanaian student identified as Nana Adjei in Latvia. Upon receiving the information, the Ministry of Foreign Affairs immediately initiated investigations through the appropriate diplomatic channels. Mr Ablakwa has since met with the family of the late Nana Agyei Ahyia, assuring them of the government’s commitment to uncovering the facts surrounding the incident. He further informed the family that a fact-finding mission would be dispatched from Ghana’s Embassy in Germany, which holds concurrent accreditation to Latvia, to support the investigations. According to the Minister, Latvian authorities have indicated their readiness to receive the Ghanaian delegation in Riga on January 20, 2026, to facilitate direct engagement and cooperation. “I promised regular updates in the interest of transparency, accountability and justice, and I shall continue to do just that,” Mr Ablakwa stated. “As I have reiterated, the Mahama administration values every Ghanaian life, whether at home or abroad, and we are prepared to do whatever it takes to safeguard the dignity of all Ghanaians.” The Ministry of Foreign Affairs has assured the public that it will continue to work closely with Latvian authorities and keep the family and the nation informed as investigations progress.",
    "image": "https://www.graphic.com.gh/images/2025/dec/23/ablakwa22222.jpg",
    "timestamp": "2025-12-30T03:43:30.766Z"
  },
  {
    "_id": "69534a65732c1ea73012ab25",
    "url": "https://www.graphic.com.gh/news/general-news/tor-resumes-crude-oil-refining-operations.html",
    "title": "TOR resumes crude oil refining operations with about 28,000 barrels per stream daily",
    "text": "The Tema Oil Refinery (TOR) has officially resumed crude oil refining operations after several years of inactivity, marking a significant milestone in efforts to revitalise Ghana’s downstream petroleum sector and strengthen national energy security. The resumption follows the successful completion of major Turnaround Maintenance (TAM) works on the refinery’s Crude Distillation Unit (CDU), carried out over three months from August 1 to October 30, 2025. The resumption of refining at TOR was expected to have positive implications for fuel availability, foreign exchange savings, job creation, and the overall stability of Ghana’s petroleum supply chain. A press statement dated December 27, 2025, and issued by TOR said the maintenance exercise involved extensive repairs, inspections, and upgrades to critical systems that was executed in strict adherence to international engineering, safety, and operational standards. After the completion of the TAM, the National Petroleum Authority (NPA) conducted comprehensive regulatory inspections at the refinery to assess its readiness for operations. It said the NPA subsequently confirmed TOR’s full compliance with all mandatory safety and operational requirements and granted clearance for the refinery to resume crude oil processing. The company indicated that as part of a phased return to full capacity, TOR was currently operating at about 28,000 barrels per stream day (bpsd). TOR management said the refinery would continue operating in the coming months to stabilise systems, optimise performance, and ensure sustained operational reliability ahead of its official recommissioning. The statement further indicated that as a further sign of progress, TOR has completed the installation of a new furnace, known as F-61, which was expected to be commissioned and integrated into the CDU in the near future. \"The installation of the new furnace is projected to restore the refinery’s original nameplate capacity of 45,000 bpsd.\" the statement added. Management of TOR also outlined plans to expand production capacity to 60,000 barrels per stream day (bpsd) in the medium term, following the installation of a new air-cooler. It said the government was expected to formally commission and tie in the F-61 furnace at a later date to be communicated to stakeholders and the general public. Management of TOR expressed appreciation to President John Dramani Mahama for his support, leadership, and commitment to restoring the refinery as a critical component of Ghana’s energy infrastructure. It also acknowledged the role of the Minister for Energy and Green Transition, Dr. John Abdulai Jinapor, noting that his policy leadership, technical oversight, and hands-on engagement were instrumental in bringing TOR back to operational life. The company also commended the board, management, and the workforce for their resilience, professionalism, and dedication throughout the revival process, describing the journey as challenging but ultimately rewarding. Management of TOR reiterated the refinery’s commitment to safe, efficient, and sustainable operations as it reclaims its role as a cornerstone of the country’s energy sector.",
    "image": "https://www.graphic.com.gh/images/2018/oct/22/TEMAFINAL.jpg",
    "timestamp": "2025-12-30T03:43:33.004Z"
  },
  {
    "_id": "69534a65732c1ea73012ab28",
    "url": "https://www.graphic.com.gh/news/education/meet-81-year-old-father-of-ucc-acting-vice-chancellor-prof-aheto-who-recently-graduated-with-an-mba.html",
    "title": "Meet 81-year-old father of UCC acting Vice-Chancellor Prof Aheto who recently graduated with an MBA",
    "text": "For the 81-year-old Joseph Aheto, when he realised three years ago in 2022, that all his children had overtaken his level of education and were now professors, he decided to enroll at the University of Cape Coast (UCC) to pursue a Master of Business Administration (MBA) Programme. He obtained his first degree in Business Administration from the University of Ghana in 1978, according to a report published by the University of Cape Coast. Not wanting to cite age, family responsibilities, or being a pensioner as a reason to discourage him, he decided to go back to school and pursue higher education. He chose to pursue an MBA in Entrepreneurship and Small Enterprise Development Studies at the UCC where one of his sons, Prof Denis Aheto was the then Pro-Vice-Chancellor and currently the acting Vice Chancellor. Thankfully, he successfully went through the programme, and got his son, Prof Dennis Aheto, the current acting Vice Chancellor, congratulating him at the 9th session of the 58th congregation of the university. Read also: Acting Vice-Chancellor's father graduates at 81. Speaking to the press, Mr. Aheto said he was inspired to pursue further studies when he realised his two sons, who are all professors, had overtaken him. “I feel very much excited to have my own son graduating me,” Mr Aheto told the press after the graduation ceremony. He said apart from the grace of God, which made this feat possible, his family, course mates, and lecturers also motivated him to push on. “When I enrolled and commenced lectures, many of the younger students in my class were surprised and were laughing and mocking me, What at all do this old man want in life. But that didn't deter me. I soldiered on, and now I have graduated,\" he said. According to him, no one should feel too old to go back to school as learning remains a lifelong adventure. Recounting his campus days, he said it felt uneasy in the initial months in the lecture halls. \"Sitting down for lectures for many hours proved very challenging, considering my age. I had pains in my foot and waist from the long hours of sitting. But after a few months, I adjusted to the system and gradually shrugged them off and moved on,” he added. Mr. Aheto, who was a class teacher in 1966 before relocating to Nsawam, urged all the graduates to concentrate on their life’s endeavour. He advised the younger ones that \" Every student who is aspiring to be someone in the future should work hard. Whatever you do, do it with resilience and hard work. The acting Vice-Chancellor, Prof Denis Aheto, commended the tenacity and resilience of his father to pursue further studies. He urged the younger ones to eschew the get-rich-quick syndrome and strive to pursue further studies. \"Age can never be a limit to education. Old age is about mindset. We need to re-conform as a society.\" he added",
    "image": "https://www.graphic.com.gh/images/2025/dec/26/aheto1.jpg",
    "timestamp": "2025-12-30T03:43:33.134Z"
  },
  {
    "_id": "69534a65732c1ea73012ab2b",
    "url": "https://www.graphic.com.gh/news/general-news/ho-mosque-shooting-incident-police-arrest-10-suspects-and-names.html",
    "title": "Ho mosque shooting incident: Police names 9 injured victims and says all 10 arrested suspects are in custody",
    "text": "A total of 10 suspects have been arrested by the police and placed in custody, following the shooting incident at the Central Mosque in Ho in the Volta Region on Boxing Day. The Volta Regional Police Public Affairs Officer, Chief Inspector Francis Gomado told Graphic Online's Alberto Mario Noretti that nine injured victims who are receiving treatment at the hospital have been identified. Chief Inspector Gomado named the injured victims as Yusuf Hamani, 30; Ibrahim Awudu, 25; Abdul Osaka, 28; Ibrahim Asadoe, 22; and Lukman Maman, 29. The others are Alhassan Shaba, 22; Yakubo Ibrahim, 24; Seidu Raffle, 24, and Kassim Basbiru, 23. Read also: Injuries recorded in reported shooting incident at Ho Central Mosque, 10 suspects arrested by police Chief Inspector Gomado said six spent cartridges was retrieved from the scene. He said a manhunt was underway for the rest of the suspects. He said the commotion was between two factions who were fighting over the right of access to the mosque, which had been closed for some time now. “It was when one faction started changing the locks to the mosque that the problem started,” he told the Graphic Online. Chief Inspector Gomado said calm had since been restored at the Sabong-Zango, with the police maintaining peace and order at the place. All check points have been alerted to be on the lookout for suspicious vehicles and occupants, he added. Meanwhile, the Deputy Volta Regional Police Commander, ACP Samuel Okunor had met with the leadership of the feuding factions and cautioned them to refrain from any further violence.",
    "image": "https://www.graphic.com.gh/images/2025/dec/26/ho11.jpg",
    "timestamp": "2025-12-30T03:43:33.688Z"
  },
  {
    "_id": "69534a68732c1ea73012ab2e",
    "url": "https://www.graphic.com.gh/news/general-news/accra-41-suspected-mobile-money-fraudsters-busted-in-dawn-operation-at-tabora-and-lashibi.html",
    "title": "Accra: 141 suspected mobile money fraudsters busted in dawn operation at Tabora and Lashibi",
    "text": "As part of efforts to clamp down on cybercrime, especially mobile money fraudsters, a total of 141 suspects have been arrested in an intelligence-led operation. The Cyber Security Authority Ghana working in collaboration with the police on Saturday arrested the suspects at Tabora and Lashibi in Greater Accra. The coordinated early-morning operation took place across key locations in Tabora and Lashibi. According to the Minister for Communication, Digitalisation and Innovation, Samuel Nartey George, a total of 100 were arrested at Tabora and the remaining 41 were picked up at Lashibi. He said preliminary investigations suggest that the suspects are predominantly Nigerian nationals. 38 laptops and 150 mobile phones suspected to be gadgets the suspects used in the fraudulent activities have been seized. The landlord of the house, who allegedly provided accommodation for 100 of the suspects has also been arrested. He said forensic analysis of the seized electronic devices is currently underway, and persons found to be culpable will be processed in accordance with Ghanaian law.",
    "image": "https://www.graphic.com.gh/images/2025/dec/27/fraud.jpg",
    "timestamp": "2025-12-30T03:43:36.228Z"
  },
  {
    "_id": "69534a68732c1ea73012ab31",
    "url": "https://www.graphic.com.gh/international/international-news/israel-recognises-somaliland-as-independent-state-netanyahu-says.html",
    "title": "Israel recognises Somaliland as independent state, Netanyahu says",
    "text": "Israel has become the first country to formally recognise Somalia's breakaway region of Somaliland as an independent nation. Prime Minister Benjamin Netanyahu, said Israel intended to immediately expand cooperation in agriculture, health, and technology. Somaliland's president, Abdirahman Mohamed Abdullahi, called the development \"a historic moment\". Recognition by Israel could encourage other nations to follow suit, increasing the region's diplomatic credentials and access to international markets. Somalia's prime minister, Hamza Abdi Barre, said his country categorically and unequivocally rejected what he called a deliberate attack by Israel on its sovereignty. Abdullahi said in a statement that Somaliland would join the Abraham Accords, in what he called a step toward regional and global peace. Somaliland was committed to building partnerships, boosting mutual prosperity and promoting stability across the Middle East and Africa, he added. The decision has been condemned by the foreign ministers of Somalia, Egypt, Turkey and Djibouti, who in a statement affirmed their \"total rejection\" of Israel's announcement. The two countries had agreed to establish \"full diplomatic ties, which will include the appointment of ambassadors and the opening of embassies\", Israeli Foreign Minister Gideon Saar said in a statement on X. \"I have instructed my ministry to act immediately to institutionalise ties between the two countries across a wide range of fields,\" he said. Meanwhile, Egypt's foreign minister held separate phone calls with his counterparts in Somalia, Turkey and Djibouti to discuss issues including Israel's declaration. In a statement, Egypt's foreign ministry said the four countries reaffirmed their support for Somalia's unity, sovereignty and territorial integrity, and warned against unilateral steps that could undermine stability or create what they called \"parallel entities\" to Somalia's state institutions. They also argued that recognising the independence of parts of sovereign states would set a dangerous precedent under international law and the United Nations Charter. The statement added that the ministers reiterated their rejection of any plans to displace Palestinians outside their homeland. Israel has for years been trying to bolster relations with countries in the Middle East and Africa, but recent wars including in Gaza and against Iran have been seen as a hindrance to democracy. Historic deals struck late in Trump's first term in 2020, known as the Abraham Accords, saw several countries including Muslim-majority United Arab Emirates and Morocco normalise relations with Israel, with other countries joining later. Somaliland has a strategic position on the Gulf of Aden, and has its own money, passports and police force. Born in 1991 after a war of independence against former dictator General Siad Barre, it has grappled with decades of isolation ever since. With a population of almost six million, the self-proclaimed republic has recently been at the centre of several regional disputes involving Somalia, Ethiopia and Egypt. Last year, an agreement between landlocked Ethiopia and Somaliland to lease a stretch of coastline for a port and military base angered Somalia.",
    "image": "https://www.graphic.com.gh/images/2025/dec/27/Mohamed.jpg",
    "timestamp": "2025-12-30T03:43:36.413Z"
  },
  {
    "_id": "69534a68732c1ea73012ab34",
    "url": "https://www.graphic.com.gh/news/general-news/ges-condemns-theft-of-food-supplies-at-awaso-stem-shs-by-matron-and-cook.html",
    "title": "GES condemns theft of food supplies at Awaso STEM SHS by matron and cook",
    "text": "The Ghana Education Service (GES) has condemned the theft of food supplies meant for students of the Awaso STEM Senior High School in the Western North Region. Two staff members of a STEM senior high school at Awaso were on December 22, 2025 arrested by the police over an alleged theft of large quantities of food items meant for students. The police named the suspects as Bennedicta Nyamadi, a school matron, and Rahel Kyeremateng, a cook. The Western North Regional Police Command said the arrests followed intelligence received by the Bibiani Anhwiaso Bekwai Municipal Chief Executive. Acting on the information, a joint team made up of police officers, the Member of Parliament for the area, and the Municipal Chief Executive searched the residence of Kyeremateng at Sefwi Atronsu. Large quantities of food items suspected to have been taken from the school were retrieved from the house. Read also: Sefwi: Police arrest matron and cook over alleged theft of food items for students at SHS In a statement dated December 26, 2026 [copy attached below] the Ghana Education Service said it does not condone any form of misconduct, abuse of office, or actions that compromise the welfare, nutrition, and wellbeing of students. It said if the allegations are proven, the conduct would be in clear violation of the Service’s ethical standards, professional code of conduct, and core values. It said the matter is currently under investigation by the Ghana Police Service",
    "image": "https://www.graphic.com.gh/images/2025/dec/25/foodtheft.jpg",
    "timestamp": "2025-12-30T03:43:36.716Z"
  },
  {
    "_id": "69534a6b732c1ea73012ab38",
    "url": "https://www.graphic.com.gh/news/education/two-smart-classroom-projects-commissioned-at-battor-and-aveyime-battor-senior-high-schools-to-help-boost-stem-education.html",
    "title": "Two smart classroom projects commissioned at Battor and Aveyime-Battor senior high schools to help boost STEM education",
    "text": "As part of efforts to enhance Science, Technology, Engineering and Mathematics (STEM) education, two smart classroom projects have been commissioned at the Battor Senior High Technical School (BASEC) and Aveyime-Battor Senior High School (ABAST), all in the North Tongu constituency of the Volta Region, by the Member of Parliament for the area, Samuel Okudzeto Ablakwa. The initiative, implemented through a partnership with the Chinese government, aims to enhance digital learning and equip students with practical STEM skills. Mr. Ablakwa, who is also the Minister of Foreign Affairs, expressed gratitude to the Chinese Ambassador to Ghana, Tong Defa, for what he described as an impactful and timely collaboration that will significantly improve teaching and learning outcomes in beneficiary schools. The smart classrooms are fully equipped with internet, smartboards, tablets, solar panels, and relevant digital educational content to support interactive and technology-driven instruction. This phase of the project covers two senior high schools in the constituency, Battor Senior High Technical School (BASEC) and Aveyime-Battor Senior High School (ABAST). According to the Minister, the partnership arrangement saw the Chinese partners provide the STEM equipment and solar systems, while he facilitated the construction of the classroom infrastructure to ensure the facilities were fit for purpose. Mr Ablakwa reaffirmed his commitment to advancing quality education and bridging the digital divide, particularly in underserved communities, noting that investments in STEM education are critical to Ghana’s long-term development and competitiveness.",
    "image": "https://www.graphic.com.gh/images/2025/dec/27/STEM.jpg",
    "timestamp": "2025-12-30T03:43:39.003Z"
  },
  {
    "_id": "69534a6b732c1ea73012ab3a",
    "url": "https://www.graphic.com.gh/news/general-news/fire-service-rescues-passengers-after-multi-vehicle-crash-near-kintampo-waterfalls.html",
    "title": "Fire Service rescues passengers after multi-vehicle crash near Kintampo Waterfalls",
    "text": "The Ghana National Fire Service (GNFS) on Wednesday responded to a distress call involving a multiple-vehicle accident near the Kintampo Waterfalls. According to the GNFS, the call was received at about 3:59 pm, prompting the dispatch of a rescue team that arrived at the scene at approximately 5:24 pm. Upon arrival, firefighters observed a series of collisions involving several vehicles, including a Mercedes Sprinter which had rammed into parked cars and subsequently caught fire. The December 24, 2025 incident occurred at a time efforts were underway to tow a Kia Bongo vehicle that had fallen into a pit three days earlier. In all, 26 passengers were trapped at the scene and were rescued by the GNFS crew. Three individuals sustained injuries during the incident and were promptly conveyed to the Kintampo Municipal Hospital for medical treatment.",
    "image": "https://www.graphic.com.gh/images/2025/dec/27/fireservice.jpg",
    "timestamp": "2025-12-30T03:43:39.087Z"
  },
  {
    "_id": "69534a6b732c1ea73012ab3d",
    "url": "https://www.graphic.com.gh/features/opinion/the-year-ends-in-fear-not-relief-and-the-developing-world-stands-most-at-risk.html",
    "title": "The year ends in fear, not relief, and the developing world stands most at risk",
    "text": "As the year draws to a close, there is little sense of comfort in the world. Instead of relief, there is tension. Wars continue, global rivalries are sharpening, and trust between nations is thinning. For many people, the concern is no longer whether instability will grow, but how far it might spread, and how long it might last. Not long ago, peace was widely assumed. Conflict felt distant, limited to certain regions, or manageable through diplomacy. That assumption is fading. Across Europe, governments are increasing military spending, strengthening civil defence systems, and warning their citizens to prepare for difficult times ahead. In June 2024, NATO Secretary-General Mark Rutte, speaking at the NATO Defence Ministers’ Meeting in Brussels, warned that Russia could be capable of confronting NATO within five years if current trends continue. His message was blunt: Europe can no longer treat peace as guaranteed. Similar warnings have come from national leaders. In February 2024, Germany’s Defence Minister, Boris Pistorius, told the Bundestag that his country must be ready for the possibility of war in the coming decade, urging Germans to accept that security would require sacrifice. These were not dramatic statements made for headlines. They were signs of a world adjusting to danger. What makes this moment especially troubling is that fear is no longer limited to the coming year. There is a growing sense that instability could define the next decade. War talk is becoming normal. While powerful countries focus on military readiness, the developing world watches with concern. Africa, in particular, stands exposed. It is not driving today’s global tensions, yet it is often among the first to suffer their consequences. If global conflict expands, Africa is likely to feel it first through economic pain rather than military action. Disrupted supply chains push food and fuel prices higher. Weaker currencies make imports more expensive. According to the World Bank, more than 60 per cent of African countries are already at high risk of debt distress. A prolonged global crisis would worsen this situation. African leaders have warned about this repeatedly. Addressing the United Nations General Assembly in September 2023, President Nana Addo Dankwa Akufo-Addo cautioned that wars and geopolitical rivalries were undoing years of development progress in Africa, even when those wars were fought far away. He expanded on this warning at the Munich Security Conference in February 2024, where he argued strongly that Africa must not become a stage for proxy conflicts. “Africa must not be drawn into the geopolitical rivalries of others,” he said, urging the world to choose dialogue over division and cooperation over confrontation. This message remains relevant. As global tensions rise, Africa’s strategic importance is growing. Its minerals, energy resources, trade routes, and diplomatic influence are increasingly valuable. This brings opportunity, but also risk. Pressure to take sides is real. Ghana’s current President, John Dramani Mahama, acknowledged this changing global environment in his inauguration address on January 7, 2025. Speaking at Black Star Square, he noted that Ghana was taking office “at a time of deep global uncertainty,” and reaffirmed the country’s commitment to peace, diplomacy, and balanced international relations. That commitment matters. Ghana’s long-standing foreign policy of non-alignment and peaceful engagement has served it well. In a divided world, that approach is not weakness, it is wisdom. The key question now is how Africa can protect itself from the fallout of global instability. One answer lies in stronger regional cooperation. African countries must work more closely through the African Union and regional blocs to coordinate economic policy, security efforts, and diplomatic positions. Another lies in self-reliance. Greater investment in food security, local manufacturing, and energy independence can reduce exposure to global shocks. The less Africa depends on distant supply chains, the more resilient it becomes. Africa must also speak more clearly on the global stage. Neutrality does not mean silence. It means confidently advocating for peace, reform of global institutions, fairer trade, and sustainable development. There is reason for cautious optimism. Africa has the world’s youngest population, growing technological capacity, and increasing diplomatic weight. These are strengths that can be used to shape outcomes, not just endure them. As the year ends, the most worrying sign is how normal fear has become. War planning feels permanent. Crisis language is routine. Peace is discussed less as a goal and more as a break between conflicts. For the developing world, this is deeply concerning. When global systems fail, poorer nations suffer first and recover last. They did not cause today’s instability, yet they bear much of its cost. The coming year will test global leadership, and African leadership too. The dangers are real. But so is the opportunity for Africa to insist on peace, protect its interests, and refuse to be dragged into conflicts not of its making. The year may end in fear. But Africa still has a choice not to end in despair.",
    "image": "https://www.graphic.com.gh/images/2025/dec/25/0d1fae32-49d2-4afa-b67b-d04796437bee.jpeg",
    "timestamp": "2025-12-30T03:43:39.553Z"
  },
  {
    "_id": "69534a6e732c1ea73012ab40",
    "url": "https://www.graphic.com.gh/news/general-news/police-kill-3-robbers-during-shootout-at-anwiankwanta.html",
    "title": "Ashanti: Police kill 3 suspected robbers during shootout at Anwiankwanta on Christmas Eve",
    "text": "Three suspected robbers were killed during a shootout with the police in a bush between Anwiankwanta and the Jacobu Junction in the Ashanti Region on Christmas Eve. The three were part of a gang of five who reportedly opened fire on the police when they saw them. The remaining two are on the run. Following the shootout, the suspects, who sustained injuries, were taken to the Bekwai Municipal Hospital, where they were pronounced dead on arrival. They have been identified as Seidu Issah, 29, Musah Yakubu, 35 and Yahaya Munkaila a.k.a. Tijani, 25. Their bodies have been deposited in the hospital's morgue for preservation and autopsy. \"An investigation is underway, and efforts are being made to apprehend the accomplices and retrieve the guns,\" a police situational report (SITREP), a copy of which has been seen by Graphic Online, stated. The SITREP indicated that Seidu, Tijani and others were wanted persons in connection with several robberies and killings in Manso, Jacobu and the Anwiankwanta area. It said on December 24, 2025, the police command received intelligence that the gang had converged in a bush in between Anwiankwanta and Jacobu junction, preparing to strike on the Anwiankwanta - Obuasi road. \"An intelligence-led operation was conducted, and the team deployed four service vehicles that raided the converging place in a bush near Anwiankwanta. \"The team on arrival spotted about five young men with guns. The gang on seeing police opened fire and attempted to escape through the bush. The police tactically returned fire, and three suspects sustained gunshot injuries but the other two with suspected gunshot wounds managed to escape,\" the report indicated. The report said two pump-action guns loaded with six rounds of ammunition each, and one unbranded pistol were retrieved from the scene. Also a sack containing 25 live cartridges and six spent cartridges were retrieved.",
    "image": "https://www.graphic.com.gh/images/2025/dec/25/robbers.jpg",
    "timestamp": "2025-12-30T03:43:41.993Z"
  },
  {
    "_id": "69534a6e732c1ea73012ab43",
    "url": "https://www.graphic.com.gh/international/international-news/120-000-stolen-from-ghanaian-financial-institution-by-hackers-interpol.html",
    "title": "$120,000 stolen from Ghanaian financial institution by hackers - INTERPOL",
    "text": "A Ghanaian financial institution was hit by a major ransomware attack that encrypted vast volumes of data and disrupted critical services, INTERPOL has disclosed. According to INTERPOL, the ransomware attack on the Ghanaian institution (name withheld) resulted in the encryption of 100 terabytes of data and the theft of approximately USD 120,000, severely affecting operations and access to sensitive systems. Ghanaian authorities responded with advanced malware analysis, which enabled investigators to identify the specific ransomware strain used in the attack. This led to the development of a decryption tool that successfully recovered nearly 30 terabytes of encrypted data, significantly reducing the damage caused. INTERPOL said multiple suspects linked to the attack have been arrested, as investigations continue into the wider criminal network behind the breach. The case formed part of a broader operation that led to 574 arrests across Africa and the recovery of about USD 3 million in illicit proceeds, with financial losses linked to the investigated cases estimated at more than USD 21 million. Neal Jetton, INTERPOL’s Director of Cybercrime, warned of the increasing sophistication of cyberattacks across the continent, particularly against essential sectors such as finance and energy. “The scale and sophistication of cyberattacks across Africa are accelerating, especially against critical sectors like finance and energy. The outcomes from Operation Sentinel reflect the commitment of African law enforcement agencies, working in close coordination with international partners. Their actions have successfully protected livelihoods, secured sensitive personal data and preserved critical infrastructure,” he said. INTERPOL noted that Operation Sentinel was conducted under the African Joint Operation against Cybercrime and supported by international partners, including private sector cybersecurity firms that provided technical assistance in tracing malicious activity and freezing illicit financial assets. The attack has renewed calls for stronger cybersecurity frameworks and continuous investment in digital resilience within Ghana’s financial system as cybercriminals increasingly target institutions holding large volumes of sensitive data.",
    "image": "https://www.graphic.com.gh/images/2023/mar/02/cyber.jpg",
    "timestamp": "2025-12-30T03:43:42.443Z"
  },
  {
    "_id": "69534a6e732c1ea73012ab46",
    "url": "https://www.graphic.com.gh/news/general-news/police-net-120-suspects-in-major-east-legon-drug-and-crime-swoop.html",
    "title": "Police net 120 suspects in major East Legon drug and crime swoop",
    "text": "A police operation to clamp down on illicit drug dealers and criminal gangs in the East Legon enclave has led to the arrest of 120 suspects, including six women. Following the arrests, the suspects were taken to the East Legon Police Station for screening to identify those connected to specific crimes and others suspected of dealing in illicit drugs. “The operation was led by ACP Saviour Ahiamadi and supported by other senior officers, including DSP Malaika-Jibril Alhassan, DSP Richard Beriko, ASP Afram and ASP Sarpong, all from Police Headquarters, as well as ASP Imoro from the Accra Region,” a police report said. The exercise was carried out through a joint operation involving personnel from the Police Intelligence Directorate, the Criminal Investigations Department, the National Operations Directorate, and the Accra and East Legon regional commands, among others.",
    "image": "https://www.graphic.com.gh/images/2025/dec/25/image.jpg",
    "timestamp": "2025-12-30T03:43:42.729Z"
  },
  {
    "_id": "69534a6e732c1ea73012ab49",
    "url": "https://www.graphic.com.gh/international/international-news/nigeria-provided-us-with-intelligence-for-strikes-on-islamist-militants-says-foreign-minister.html",
    "title": "Nigeria provided US with intelligence for strikes on Islamist militants, says foreign minister",
    "text": "Nigeria provided the US with intelligence on jihadists before the strikes that took place in the country on Christmas Day, its foreign ministry, Nigeria’s foreign minister, Yusuf Tuggar said on Friday. On Thursday, the US president, Donald Trump, said the US military had carried out strikes against Islamic State militants in north-west Nigeria, after spending weeks decrying the group for targeting Christians. In a post on his Truth Social platform, the president said: “Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries! “I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was. The Department of War executed numerous perfect strikes, as only the United States is capable of doing.” Now, Nigerian foreign minister, Yusuf Tuggar, has told broadcaster ChannelsTV that he was on the phone with the US secretary of state, Marco Rubio, and that Nigeria “provided” the intelligence. “We spoke twice. We spoke for 19 minutes before the strike and then we spoke again for another five minutes before it went on,” Tuggar said. He added that they spoke “extensively” and that President Bola Tinubu gave “the go-ahead” to launch the strikes. Tuggar said the strikes would be an “ongoing process” that would also involve other countries. He gave no further details. Trump has previously said he would launch a “guns-a-blazing” US military intervention in Nigeria, claiming that the country’s government has been inadequate in its efforts to prevent attacks on Christians by Islamist groups.",
    "image": "https://www.graphic.com.gh/images/2025/dec/25/Tuggar.jpg",
    "timestamp": "2025-12-30T03:43:42.870Z"
  },
  {
    "_id": "69534a71732c1ea73012ab4c",
    "url": "https://www.graphic.com.gh/news/general-news/mtn-ghana-hands-over-hampers-to-25-newly-born-bronya-babies-at-cape-coast-hospital.html",
    "title": "MTN Ghana hands over hampers to 25 newly born 'bronya' babies at Cape Coast Hospital",
    "text": "Christmas cheer filled the maternity ward of the Cape Coast Teaching Hospital (CCTH) as MTN Ghana extended love and support to 25 babies born on Christmas Day, December 25, 2025, with the donation of hampers. The gesture, which formed part of MTN Ghana’s corporate social responsibility, brought smiles to the new mothers. Each hamper contained essential baby care items, including diapers, baby powder, pomade, bathing soap, towels and other necessities for newborns. She said the donation formed part of MTN Ghana’s annual Christmas outreach, reinforcing the company’s commitment to community support, compassionate service and national development. The Deputy Nursing Officer at CCTH, Veronica Koomson expressed appreciation to MTN Ghana, noting that some mothers reported to the hospital for delivery without basic items. Vida Obosu, who gave birth to a baby girl, described the gesture as a “Christmas blessing,” while Salamatu Nuhu, also a mother to a baby girl, said the items would greatly ease the early days of childcare.",
    "image": "https://www.graphic.com.gh/images/2025/dec/26/bronya.jpg",
    "timestamp": "2025-12-30T03:43:45.587Z"
  },
  {
    "_id": "69534a71732c1ea73012ab4f",
    "url": "https://www.graphic.com.gh/news/general-news/seven-injured-in-shooting-at-ho-central-mosque-in-volta-region.html",
    "title": "9 people injured in Ho mosque shooting incident, 10 suspects arrested by police",
    "text": "A total of nine people got injured on Friday morning after some masked armed men stormed the Ho Central Mosque in the Volta Region, amidst sporadic shooting. The incident happened around 9:30 am. The attack was linked to a protracted dispute between two factions claiming the Volta Regional Chief Imam position. Chief Inspector Francis Gomado, speaking for the Volta Regional Police Command, said 10 suspects have been arrested and are assisting with investigations. Some others, whom he said were in a pick-up vehicle the attackers used, managed to run away before the arrival of the police. He said calm has since returned to the area. A day after the incident, the Volta Regional Police Public Affairs Officer, Chief Inspector Francis Gomado told Graphic Online's Alberto Mario Noretti that all the nine injured victims were receiving treatment at the hospital and have been identified. Chief Inspector Gomado named the injured victims as Yusuf Hamani, 30; Ibrahim Awudu, 25; Abdul Osaka, 28; Ibrahim Asadoe, 22; and Lukman Maman, 29. The others are Alhassan Shaba, 22; Yakubo Ibrahim, 24; Seidu Raffle, 24, and Kassim Basbiru, 23. Chief Inspector Gomado said six spent cartridges was retrieved from the scene. He said a manhunt was underway for the rest of the suspects. He said the commotion was between two factions who were fighting over the right of access to the mosque, which had been closed for some time now. “It was when one faction started changing the locks to the mosque that the problem started,” he told the Graphic Online. Chief Inspector Gomado said calm had since been restored at the Sabong-Zango, with the police maintaining peace and order at the place. All check points have been alerted to be on the lookout for suspicious vehicles and occupants, he added. Meanwhile, the Deputy Volta Regional Police Commander, ACP Samuel Okunor had met with the leadership of the feuding factions and cautioned them to refrain from any further violence.",
    "image": "https://www.graphic.com.gh/images/2025/dec/26/ho2.jpg",
    "timestamp": "2025-12-30T03:43:45.757Z"
  },
  {
    "_id": "69534a72732c1ea73012ab52",
    "url": "https://www.graphic.com.gh/news/general-news/volta-regional-house-of-chiefs-renew-call-on-immigration-to-remove-inland-barriers-at-sogakope-asikuma.html",
    "title": "Volta Regional House of Chiefs renew call on Immigration to remove inland barriers at Sogakope, Asikuma",
    "text": "The Volta Regional House of Chiefs (VRHC) has renewed its call on the Ghana Immigration Service (GIS) to remove the inland barriers at Sogakope and Asikuma. “Those barriers are not serving the national interest; they are only there, demeaning and harassing travelers for no reason,” the President of the house, Togbe Tepre Hodo IV said at the last meeting of the house for the year 2025, at Ho, on Tuesday (Dec 23, 2025). He said Sogakope and Asikuma were not entry or exit points for travelers, and there were no secessionist threats from the Western Togoland Group. For that matter, Togbe Tepre, Hodo who is Paramount Chief of Anfoega, said it was high time the two immigration posts were removed to help restore the dignity of travelers. He asked that the Volta Regional Minister should arrange a meeting between the house and the Minister of the Interior for a thorough discussion on the issue. “We do not see inland immigration barriers in other parts of the country, so we need to know why we have them in our area,” he added. He said he was asked to produce his passport at the inland barrier, in a very intimidating tone, without any recognition of his status as a chief. “It is most unfortunate that the Ghana Immigration Service personnel whose uniforms were bought with our taxes could disrespect and humiliate us to such an extent,” he said. The Volta Regional Minister, James Gunu who was at the meeting assured that he would arrange the meeting between the house and the Minister of the Interior as soon as possible.",
    "image": "https://www.graphic.com.gh/images/2025/dec/26/vrhc.jpg",
    "timestamp": "2025-12-30T03:43:46.261Z"
  },
  {
    "_id": "69534a72732c1ea73012ab55",
    "url": "https://www.graphic.com.gh/sports/sports-news/how-ga-became-the-home-of-boxing.html",
    "title": "How Ga became the home of boxing",
    "text": "Boxing was organised as a sport in Accra in the early twentieth century, influenced by both Western boxing and the indigenous Ga sport, asafo atwele. The Ga state rose to prominence in the sixteenth century, controlling Akwamu, until it was defeated in wars from 1677 to 1681, leading to its decline. The royal family fled, while others settled in Little Accra. Akwamu’s dominance ended with the Accra-Akyem-Akwapim alliance’s victory in 1730, allowing the Ga state to be reformed in Accra, comprising two towns: James Town and Ussher Town, each subdivided into several quarters. Each Ga town sought settlers, utilizing asafo companies composed of all able-bodied individuals, including slaves, for defense. As warfare ceased to be a wealth source in colonial Gold Coast, chiefs resorted to land sales, causing rifts among them. Notably, James Town declared independence from Ussher Town, leading to conflicts over land and chief destoolment in the 1880s and 1920s. The political turmoil in Accra during the 1920s and 1930s prompted the need for asafo companies to engage their fighters in organized competitions called asafo atwele, with the rallying cry ‘odododi-odioo.’ Contests, supervised by asafo captains (Ga: asafoatsemei), were organised in age groups between two towns, involving a unique cultural interaction focused on boxing. On Sundays, participants engaged in sea bathing, followed by a symbolic challenge ritual where a challenger would shout “odododiodioo!” and receive the response “oo aieee!” indicating acceptance. The fighting commenced among young boys starting at age 12, with participants from Ussher Fort and James Town aligning on opposing sides. Participants would then march to Bukom, the venue for a more formalised tournament that included various age groups from children to older men. The matches emphasised an exchange of blows and kicks, with victory being celebrated in style, energized by large crowds of women and girls cheering for their favored fighters. The Ga invented the fighting style and the origins of asafo atwele which involved the use of the hands and the feet in an exchange of blows and kicks. Those who fought specialised in either kla or klamo, which was an exchange of hand-blows in lightening fashion, or ntia (kicking) and there were contests that just involved the use of the legs. In the 1930s, Accra faced political conflicts involving the asafo companies, notably between the Manbii Party, led by Kojo Thompson, and the Ratepayers Association, headed by Dr. F. W. Nanka-Bruce. The colonial government banned the asafo companies as armed factions around 1935, prompting a shift of their skills towards boxing. British officer Maxwell Lawford established boxing clubs in Osu and Bukom, effectively transforming asafo atwele into regulated boxing venues. Experts from Asafo Atwele seamlessly transitioned into boxing, with Roy Ankrah, or “the Black Flash,” leading the way as the first major champion by winning the British Empire Featherweight title in 1951. This initiated a legacy of Ga lightweight champions such as Floyd Robertson and Azumah Nelson. Notable boxing schools like Maconi and Sparta emerged, operating gyms in Usher Town, Palladium, and Swalaba, with the Akotoku Academy, founded by Jonas Thompson at the Methodist school in Adabraka, being the most prominent.",
    "image": "https://www.graphic.com.gh/images/2025/dec/26/BOXING_IN_GA.jpg",
    "timestamp": "2025-12-30T03:43:46.889Z"
  },
  {
    "_id": "69534a74732c1ea73012ab58",
    "url": "https://www.graphic.com.gh/international/international-news/nigeria-confirms-us-strikes-on-isil-targets-in-its-northwest.html",
    "title": "Why has Trump ordered strikes in Nigeria and what has it got to do with the persecution of Christians?",
    "text": "The Nigerian government has confirmed the attacks but dismisses US President Donald Trump’s assertions, saying armed groups target both Muslim and Christian communities in the country, and US claims that Christians face persecution ‌do not represent a complex security situation and ignore efforts by Nigerian authorities to safeguard religious freedom, reports AlJazeera. Related article: US launches deadly strikes against Islamic State in Nigeria, says Trump The United ‍States ‍has carried out an air strike against ISIL (ISIS) fighters in northwest Nigeria, US ⁠President Donald Trump has ​said, claiming that the armed group had “‌targeted and viciously” killed “primarily, innocent Christians, at ⁠levels not seen for many years, and even Centuries.” The armed groups in Africa’s most populous country include at least two affiliated with ISIL – an offshoot of the Boko Haram armed group in the West Africa Province in the northeast (ISWAP), and the lesser-known ISIL affiliate in Sahel Province (ISSP) known locally as Lakurawa, the new armed group wreaking havoc on the Nigeria-Niger border and prominent in the northwest [in the Sokoto area]. Although officials did not say exactly which group was targeted, security analysts said the target, if indeed ISIL, was likely members of Lakurawa, which became more lethal in border states like Sokoto and Kebbi in the last year, often targeting remote communities and security forces. The new armed group Lakurawa, is attacking villages in remote corners of northwestern Nigeria and across the border in Niger, posing new threats to two countries that already suffer from protracted conflict involving several other groups, including Boko Haram. In November, the Nigerian army acknowledged for the first time the existence of Lakurawa and said its members were operating from headquarters in the country’s Sokoto and Kebbi states. Attacks by the group have killed dozens of people, and at least nine suspected members are known and have been declared wanted by the Nigerian army. The northern region is one of the hottest beds of violence in Nigeria, with its states experiencing a toxic mix of armed attacks, kidnappings and banditry in recent years. The Nigerian army has also been grappling with a long-running battle with the Boko Haram armed group in the northeast for more than a decade. Strained relations between Nigeria and Niger, stemming from Niger’s coup d’etat in July 2023, have also affected joint military operations and given the Lakurawa group more room to expand, officials have said. Why has Trump ordered strikes in Nigeria and what has it got to do with the persecution of Christians? The Guardian reports that after spending weeks accusing Nigeria’s government of failing to tackle the persecution of Christians, Donald Trump announced a series of strikes on the west African country on Christmas Day. The strikes, targeting Islamic State militants in the country’s north, mark the latest overseas military intervention from Trump, who campaigned on a promise to extricate the US from decades of “endless wars” during his 2024 run for president. In his announcement, President Trump said the strikes were aimed at Islamic State militants who have been “targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!” A Defense Department official told the Associated Press that the US worked with Nigeria to carry out the strikes, and that they’d been approved by that country’s government. Nigeria’s ministry of foreign affairs said the cooperation included exchanges of intelligence and strategic coordination. Why has Trump targeted Nigeria? Parts of the US right have for years been amplifying claims that Christians are facing persecution in Nigeria. In September, Republican senator Ted Cruz pushed to sanction Nigerian officials who “facilitate violence against Christians and other religious minorities, including by Islamist terrorist groups”. Claims that Christians face religious persecution overseas have become a major motivating force Trump’s base – and the US president counts evangelical Christians as among his most enthusiastic supporters. Earlier this year he appeared to act on some of these concerns by designating Nigeria a “country of particular concern” under the US International Religious Freedom Act, which followed weeks of lobbying by American lawmakers and conservative Christian groups. Soon after, he ordered the Pentagon to begin planning for potential military action in the country. At the time, the president said he might go in “guns-a-blazing” if the Nigerian government continued to “allow the killing of Christians”. Is there religious persecution in Nigeria? In the past, Nigeria’s government has responded to Trump’s criticisms by saying that people of many faiths, not just Christians, suffer at the hands of extremists groups who operate throughout the country. Nigeria is officially secular but almost evenly divided between Muslims (53%) and Christians (45%), with the remaining population practising African traditional religions. Violence against Christians has drawn significant international attention, and is often framed as religious persecution, but most analysts argue the situation is more complex and attacks can have varying motivations. For example, deadly clashes between itinerant Muslim herders and predominantly Christian farming communities are rooted in competition over land and water but exacerbated by religious and ethnic differences. Meanwhile, the kidnappings of priests is seen by many analysts as a trend driven more by money than religious hatred, as they are viewed as influential figures whose worshippers or organisations can mobilise funds quickly. What does the Nigerian government say? After Thursday’s strikes, Nigeria’s foreign ministry praised the cooperation with the US, but pointedly refused to acknowledge America’s actions had anything to do with the persecution of Christians. “Terrorist violence in any form, whether directed at Christians, Muslims or other communities, remains an affront to Nigeria’s values and to international peace and security,” the ministry said in a statement. Successive Nigerian governments have struggled to get a hold on the nation’s deteriorating security crisis, with thousands of people killed and hundreds more abducted in the past few years. In the north-east, Boko Haram and its splinter groups such as Islamic State West Africa Province (Iswap) have waged an insurgency since 2009, killing tens of thousands and displacing millions. In the north-west, heavily armed criminal gangs – often labelled “bandits” – carry out mass kidnappings and raids that affect both Muslim and Christian communities. Nigeria’s government has previously said in response to Trump’s criticisms that people of many faiths, not just Christians, have suffered at the hands of these groups. Last month, Nigeria’s president, Bola Ahmed Tinubu, said the characterisation of Nigeria as a religiously intolerant country did not reflect reality. “Religious freedom and tolerance have been a core tenet of our collective identity and shall always remain so … Nigeria is a country with constitutional guarantees to protect citizens of all faiths.”",
    "image": "https://www.graphic.com.gh/images/2025/dec/25/nigeria_strike.jpg",
    "timestamp": "2025-12-30T03:43:48.386Z"
  }
]