[
  {
    "url": "https://www.myjoyonline.com/tema-oil-refinery-resumes-crude-refining-after-years-of-shutdown/",
    "title": "Tema Oil Refinery resumes crude refining after years of shutdown",
    "text": "The Tema Oil Refinery (TOR) has officially resumed crude oil refining operations after several years of inactivity.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nThe resumption follows the successful completion of major Turnaround Maintenance (TAM) works on the refinery’s Crude Distillation Unit (CDU), carried out between August 1 and October 30.\n\n\n\n The maintenance exercise, completed within three months, was undertaken in line with international engineering, safety, and operational standards, the Managing Director of TOR, Edmond Kombat, disclosed on Facebook.\n\n\n\nAfter the maintenance works, the National Petroleum Authority (NPA) conducted comprehensive regulatory inspections and confirmed that TOR met all mandatory safety and operational requirements. The authority has since granted clearance for the refinery to recommence refining activities.\n\n\n\n\n\n\n\nIn a statement issued on Saturday, TOR explained that refining operations will initially proceed under a phased approach, ahead of the refinery’s formal recommissioning. This period, the company said, will allow for system stabilisation, performance optimisation and the assurance of sustained operational reliability.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nAs part of its upgrade programme, TOR has also completed the installation of a new furnace, F-61, which is expected to be commissioned and integrated into the CDU in the coming months. \n\n\n\nThe installation is projected to restore the refinery’s original nameplate capacity of 45,000 barrels per stream day, up from the current operating level of 28,000 barrels per stream day. Management further outlined a strategic plan to expand capacity to 60,000 barrels per stream day in the medium term, following the installation of a new air cooler.\n\n\n\nThe government of Ghana is expected to formally commission and tie in the F-61 furnace at a later date, with details of the event to be communicated in due course.\n\n\n\nTOR expressed appreciation to President John Dramani Mahama for what it described as his continued support and leadership in restoring the refinery as a key component of Ghana’s energy infrastructure. The refinery also acknowledged the role of the Minister for Energy and Green Transition, Dr John Abdulai Jinapor, citing his technical oversight and policy leadership as instrumental to the revival process.\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n\n\nCommending its board, management and workforce, TOR praised the staff’s resilience and professionalism throughout the restoration journey. The company reaffirmed its commitment to safe, efficient, and sustainable operations as it seeks to reclaim its position as a cornerstone of Ghana’s energy sector.\n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Crude Oil                         Tema Oil Refenery                \n\n                        \n                    \n                        \n    \n      \n        \n          \n            \n            \n            \n            \n            \n          \n        \n      \n    \n  Advertisement \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Ghana records $5.57bn trade surplus in first-half of 2025                        \n                     \n\n                    \n                   \n                        \n                            Ghana saves $1.4bn since commercial export of crude oil                        \n                     \n\n                    \n                   \n                        \n                            Ghana bagged $370.62m from crude oil in first-half of 2025                        \n                     \n\n                    \n                   \n                        \n                            New board inaugurated to revitalise Tema Oil Refinery                        \n                     \n\n                    \n                   \n                        \n                            14 Years of production: Ghanaians see oil as neither blessing nor curse — Research                        \n                     \n\n                    \n                   \n                        \n                            Oil prices fall slightly, but Ghana still at risk as Israel–Iran conflict continues                        \n                     \n\n                    \n                   \n                        \n                            Crude oil production declined for the 5th consecutive year in 2024 – PIAC report                        \n                     \n\n                    \n                   \n                        \n                            Two Nigerian businessmen in court over alleged $20,000 fraud                        \n                     \n\n                    \n                   \n                        \n                            Ghana’s gross reserves end December 2024 at US$8.98bn; trade balance records surplus of  $US4.98bn                        \n                     \n\n                    \n                   \n                        \n                            Fuel prices to go down from tomorrow November 16, 2024 – COPEC",
    "image": null,
    "timestamp": "2025-12-28T01:13:28.642Z"
  },
  {
    "url": "https://www.myjoyonline.com/100-arrested-in-accras-tabora-in-major-mobile-money-fraud-crackdown/",
    "title": "100 arrested in Accra’s Tabora in major Mobile Money fraud crackdown",
    "text": "The Minister for Communications and Digital Innovation, Samuel Nartey George, has praised a major police-led operation that led to the arrest of 100 suspects in Tabora, a suburb of Accra, over alleged involvement in Mobile Money (MoMo) fraud and other cyber-enabled financial crimes.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nThe coordinated operation, carried out in the early hours of Friday, December 27, involved the Cyber Security Authority (CSA), the Ghana Police Service, National Security, and the Ghana Immigration Service.\n\n\n\nAccording to the Minister, preliminary investigations indicate that the majority of the suspects are Nigerian nationals. Security agencies also seized 38 laptops and 150 mobile phones believed to have been used in committing the offences.\n\n\n\nThe suspected crimes include MoMo fraud, romance scams, sextortion, Business Email Compromise (BEC), and wire fraud.\n\n\n\nA Ghanaian landlord was also arrested for allegedly accommodating about 100 of the suspects in his residence.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\n\n\n\n\n“This operation demonstrates our commitment to protecting Ghanaians and the business environment from cybercrime. Landlords and property owners must ensure their premises are not used to facilitate illegal activity,” the Minister noted.\n\n\n\n\n\n\n\nHe added that forensic analysis of the seized devices is ongoing, and suspects found culpable will be prosecuted under Ghanaian law.\n\n\n\nMr George also urged the public to remain vigilant and report suspicious online activities, while reassuring investors and residents that Ghana remains open to lawful business.\n\n\n\n“We welcome legitimate enterprise, but anyone attempting cybercrime in Ghana will be found, arrested, and dealt with decisively,” he stated.\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n\n\n\n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Fraud                         Mobile Money                         Samuel Nartey George                         Tabora                \n\n                        \n                    \n                        \n    \n      \n        \n          \n            \n            \n            \n            \n            \n          \n        \n      \n    \n  Advertisement \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Sam George lauds coordinated crackdown on cybercrime in Tabora and Lashibi                        \n                     \n\n                    \n                   \n                        \n                            Ghana-Nigeria cyber-fraud network dupes over 200 victims of $400,000                        \n                     \n\n                    \n                   \n                        \n                            Lawyer arraigned over alleged GH¢800k excavator fraud                        \n                     \n\n                    \n                   \n                        \n                            Cybercrime crackdown: 48 suspects arrested in Dawhenya operation                        \n                     \n\n                    \n                   \n                        \n                            Britain’s worst romance fraudster’ who scammed single mothers out of £1m is jailed for 17 years                        \n                     \n\n                    \n                   \n                        \n                            Ghana recovers over $15m from international crypto fraud syndicate – Attorney General                        \n                     \n\n                    \n                   \n                        \n                            MTN Mobile Money to undergo nationwide agent re-registration in 2026 to curb fraud                        \n                     \n\n                    \n                   \n                        \n                            People were leaking information to fraud suspects – Sam George on past failed cybercrime arrests                        \n                     \n\n                    \n                   \n                        \n                            Hubtel named Overall Best Fintech Partner at 2025 Fintech Stakeholder Dinner & Awards                        \n                     \n\n                    \n                   \n                        \n                            Mobile money transactions hits GH¢3trn as digital payments surge – BoG Report",
    "image": null,
    "timestamp": "2025-12-28T01:13:32.927Z"
  },
  {
    "url": "https://www.myjoyonline.com/ndc-cant-change-the-constitution-alone-minority-mps-hold-key-role-says-barker-vormawor/",
    "title": "NDC can’t change the constitution alone – Minority MPs hold key role, says Barker-Vormawor",
    "text": "Convener of the FixTheCountry Movement, Oliver Barker-Vormawor, has observed that the legal process required to amend recommendations by the Constitution Review Committee (CRC) could significantly enhance the influence of the minority in Parliament.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nSpeaking on the constitutional reform debate on JoyNews' Newsfile on Saturday, December 27, Barker-Vormawor explained that any attempt to amend the Constitution would require the support of at least 75 percent of Members of Parliament.\n\n\n\nHe noted that this high threshold effectively prevents a single political bloc from unilaterally driving changes.\n\n\n\n“Every conversation, every discussion must go through Parliament… so as far as this is concerned, once the people approve, all discussions, all changes go through Parliament. It is just a different threshold within Parliament. In my opinion, this is what makes the minority very powerful, irrespective of how small they are,” he said.\n\n\n\nRead also: Playback: Newsfile discussed Constitution review report and AG’s ORAL drive\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nAccording to Barker-Vormawor, even with a parliamentary majority, the National Democratic Congress (NDC) would be unable to meet the constitutional requirement alone, thereby compelling broader consensus and negotiation across the aisle.\n\n\n\n“There is no way you can be able to meet the threshold that is required for the amendments without the minority being part of it. Meaning that there is no way the NDC can run and say we are changing everything without them (Minority),” he explained.\n\n\n\nHis comments come as national attention intensifies around the CRC’s recommendations, with stakeholders assessing both the substance of the proposals and the political arithmetic required to translate them into law.\n\n\n\n\n\n\n\n\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Constitution review                         NDC                         NPP                         Oliver Barker Vormawor                         Parliament                \n\n                        \n                    \n                        \n    \n      \n        \n          \n            \n            \n            \n            \n            \n          \n        \n      \n    \n  Advertisement \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Let’s prove our readiness power through deeds, not words – Afenyo-Markin to NPP faithful                        \n                     \n\n                    \n                   \n                        \n                            This Saturday on Newsfile: Constitution review report and AG’s ORAL drive                        \n                     \n\n                    \n                   \n                        \n                            Afenyo-Markin urges NPP to move from talk to action after 2024 election loss                        \n                     \n\n                    \n                   \n                        \n                            Afenyo-Markin urges discipline, unity as NPP prepares for 2026 flagbearer primary                        \n                     \n\n                    \n                   \n                        \n                            Ashanti Regional Council of Elders commends NPP minority caucus for parliamentary resilience                        \n                     \n\n                    \n                   \n                        \n                            NPP Chairman aspirant John Boadu vows to rebuild party in Christmas message                        \n                     \n\n                    \n                   \n                        \n                            NDC highlights first year achievements, vows to stabilise economy and strengthen governance                        \n                     \n\n                    \n                   \n                        \n                            2024 defeat revealed governance and candidate failures — Bryan Acheampong                        \n                     \n\n                    \n                   \n                        \n                            One year on, NDC recounts its mandate and promises results in Christmas message                        \n                     \n\n                    \n                   \n                        \n                            No room for excuses – NDC vows to deliver fully on people’s mandate",
    "image": null,
    "timestamp": "2025-12-28T01:13:52.182Z"
  },
  {
    "url": "https://www.myjoyonline.com/dr-nyaho-nyaho-tamakloe-opposes-presidential-term-extension/",
    "title": "Dr Nyaho Nyaho-Tamakloe opposes presidential term extension",
    "text": "Veteran Ghanaian statesman Dr Nyaho Nyaho-Tamakloe has strongly opposed proposals to extend Ghana’s presidential term, insisting that the existing two four-year terms are sufficient for effective governance.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nIn a statement released this week regarding the ongoing constitutional review, Dr Nyaho-Tamakloe argued that “four years is adequate time for a serious and prepared government to make its mark,” adding that “arguments suggesting a need for additional time only create unnecessary opportunities for inefficiency and corruption.”\n\n\n\nThe former diplomat stressed that while continuity in governance is important, it should not be used as justification for lengthening presidential tenure. “Unfinished national projects must be continued by successive governments. The practice of abandoning ongoing projects in order to initiate new ones has become a major source of waste and corruption,” he said.\n\n\n\nRead Also: Dr Nyaho Nyaho-Tamakloe: On Ghana’s constitution review and the future of democratic governance\n\n\n\nDr Nyaho-Tamakloe also called for a review of provisions that grant excessive immunity and lifelong benefits to public office holders. “The Constitution contains numerous clauses that effectively shield the President during and even after his tenure in office. These protections make it nearly impossible to hold a President fully accountable under the law. This situation is no longer tenable in a mature democracy,” he noted. He further added that “the system of ex gratia payments and excessive post-office benefits for public office holders must be abolished,” urging that these resources be redirected to improve the lives of ordinary Ghanaians.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nOn the structure of government, he supported reforms aimed at strengthening accountability, including appointing ministers strictly from outside Parliament to ensure a clear separation between the Executive and Legislature. “Parliament must be empowered to independently scrutinise government actions without conflict of interest,” he said.\n\n\n\nAddressing leadership qualifications, Dr Nyaho-Tamakloe emphasised that the presidency requires maturity and experience. “The minimum age requirement for presidential candidates should be reviewed upward to reflect the seriousness and responsibility of the office,” he said.\n\n\n\nThe statesman concluded by calling on all stakeholders to approach the constitutional review process with integrity and a focus on national interest. “Constitutional reform must not be driven by partisan interests but by the collective good of the nation,” he urged, highlighting the need for accountability, discipline, and responsible governance.\n\n\n\nDr. Nyaho-Tamakloe’s statement comes ahead of the expected release of the full report of the Constitution Review Committee, which is scheduled for January 2026.\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Constitution Review Committee                         Dr Nyaho Nyaho-Tamakloe                         presidential term extension                \n\n                        \n                    \n                         \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Dr Nyaho Nyaho-Tamakloe calls for abolition of ex gratia payments, excessive benefits for public officeholders                        \n                     \n\n                    \n                   \n                        \n                            Dr Nyaho Nyaho-Tamakloe backs review of presidential immunity provisions in Ghana’s constitution                        \n                     \n\n                    \n                   \n                        \n                            Dr Nyaho Nyaho-Tamakloe: On Ghana’s constitution review and the future of democratic governance                        \n                     \n\n                    \n                   \n                        \n                            Why Ghana’s Constitution Review Committee’s Work Should Be Extended to Strategic Communication                        \n                     \n\n                    \n                   \n                        \n                            How presidential control has weakened Council of State – Prof H. Kwasi Prempeh explains                        \n                     \n\n                    \n                   \n                        \n                            A second look, not a veto – Constitution Review Chair makes case for Council of State reform                        \n                     \n\n                    \n                   \n                        \n                            Too young to lead? – Prof H. Kwasi Prempeh says Ghana’s Constitution undervalues its youth                        \n                     \n\n                    \n                   \n                        \n                            Let the people decide – Constitution Review Chair pushes back against fear of ‘young presidents’                        \n                     \n\n                    \n                   \n                        \n                            Selective justice is destroying trust in Ghana’s anti-corruption system – Prof H. Kwasi Prempeh                        \n                     \n\n                    \n                   \n                        \n                            Ghana’s democratic debate is too insular and afraid of change – Constitution Review Chair",
    "image": null,
    "timestamp": "2025-12-28T01:14:08.081Z"
  },
  {
    "url": "https://www.myjoyonline.com/kidnap-suspect-arrested-in-tamale-as-police-rescue-victim-after-four-days/",
    "title": "Kidnap suspect arrested in Tamale as Police rescue victim after four days",
    "text": "A 26-year-old man, Fuseini Ibrahim, has been arrested in Tamale for allegedly kidnapping a young woman, Haruna Adamu, who was held captive for four days.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nThe incident occurred at Dalogu Yili, a suburb of Tamale, and was reported to the police at about 9:00 a.m. on December 26.\n\n\n\nAccording to reports, the Inspector-General of Police’s (IGP) Special Operations Team, led by Chief Inspector Abdullai Tahiru, responded swiftly to the scene and rescued the victim without incident.\n\n\n\nThe suspect was apprehended and handed over to the Regional Criminal Investigations Department (CID) for further investigation, while the victim was safely reunited with her parents.\n\n\n\nMeanwhile, as part of a festive season crackdown on crime, two suspected drug peddlers were arrested in separate operations in Tamale.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nThe suspects, Ziyad Inusah and Majid Fuseini, were picked up by the IGP Special Operations Team during a routine Christmas patrol.\n\n\n\nThe team, made up of 105 personnel in 10 vehicles, targeted crime-prone areas within the Tamale Metropolis and seized quantities of opioids from one of the suspects.\n\n\n\nThe Ghana Police Service said the operation reflects its commitment to protecting lives and property and intensifying efforts to clamp down on drug peddling and other criminal activities during the festive period.\n\n\n\n\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            kidnap                         Tamale                \n\n                        \n                    \n                         \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            2 nurses, security guard arrested over alleged baby theft at Tamale hospital                        \n                     \n\n                    \n                   \n                        \n                            Police crack down on drug trafficking in Tamale, arrest 4 and seize illicit substances                        \n                     \n\n                    \n                   \n                        \n                            Tamale high court delays ruling in Anbariya vs. Technical University case                        \n                     \n\n                    \n                   \n                        \n                            Police arrest seven in Tamale drug crackdown, seize illicit substances                        \n                     \n\n                    \n                   \n                        \n                            IGP Special Operations Team nabs all-female suspected drug trafficking ring in Tamale                        \n                     \n\n                    \n                   \n                        \n                            Suspected criminal killed in gunfire exchange with police in Tamale                        \n                     \n\n                    \n                   \n                        \n                            Police Special Operations Team storms Tamale, arrests 32 suspects in major anti-crime sweep                        \n                     \n\n                    \n                   \n                        \n                            19 suspects arrested in Tamale and environs during night swoop                        \n                     \n\n                    \n                   \n                        \n                            Police arrest 16 suspects in major crime crackdown in Tamale                        \n                     \n\n                    \n                   \n                        \n                            Tamale residents applaud Cowbell for annual Bike Caravan",
    "image": null,
    "timestamp": "2025-12-28T01:14:08.088Z"
  },
  {
    "url": "https://www.myjoyonline.com/one-year-extension-of-presidential-term-unnecessary-baffuor-awuah/",
    "title": "One-year extension of presidential term unnecessary – Baffuor Awuah",
    "text": "Vice Chair of Parliament’s Subsidiary Legislation Committee and a member of the Constitutional and Legal Affairs Committee, Nana Agyei Baffuor Awuah, has described the Constitution Review Committee’s (CRC) proposal to extend the presidential term from four to five years as unnecessary.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nHe made the comments on Newsfile on JoyNews on Saturday, December 27.\n\n\n\nHis remarks follow the submission of the CRC’s final report to President John Dramani Mahama on Monday, December 22.\n\n\n\nThe report contains several key recommendations, including the separation of the legislature from the executive, a reaffirmation that the Constitution does not allow a third presidential term, and a proposal to extend the presidential term of office from four to five years.\n\n\n\nThe CRC has so far presented a summary of its findings to the President, with the full and final report expected to be made public in January.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nSpeaking on the programme, Mr Baffuor Awuah stressed the need for a thorough comparative analysis of the CRC’s proposals against earlier constitutional review efforts, particularly the report of the Professor Fiadjo Committee.\n\n\n\n\n\n\n\n“When you look at the Fiadjo Commission’s report on the tenure of the president, they conducted a historical analysis of where the four years came from,” he explained.\n\n\n\n“The Consultative Assembly initially preferred five years, the Commission of Experts recommended four, and the Powers of Government Committee opted for five. After careful evaluation, they settled on four years.”\n\n\n\nHe questioned the rationale behind the proposed extension, arguing that the justification for giving presidents more time to complete projects is largely impractical.\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n\n\n“The fundamental question is: what mischief are we seeking to cure with this proposed extension? The so-called ‘mischief’ is about giving the president time to finish his work, but practically, no president can complete everything during his tenure,” he said.\n\n\n\nMr Baffuor Awuah noted that presidents routinely initiate projects, contract loans, and pass legislation whose full impact often extends beyond their time in office.\n\n\n\nExtending the term by just one year, he argued, would not change that reality.\n\n\n\n“The issue really has to do with continuity. We should focus on passing laws or mechanisms that ensure continuity, rather than simply extending the president’s term,” he said.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article2'); });\n                    \n                    \n\n\n\n“Adding one more year will not enable the president to finish everything he starts. We need to look at how best we can achieve continuity effectively.”\n\n\n\n\n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Nana Agyei Baffuor Awuah                         presidential tenure                \n\n                        \n                    \n                         \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            I don’t believe OSP will disregard proper discretion – Lawyer on Charles Bissue’s arrest warrant",
    "image": null,
    "timestamp": "2025-12-28T01:14:08.235Z"
  },
  {
    "url": "https://www.myjoyonline.com/prof-prempeh-defends-lowering-presidential-age-cites-kufuors-early-leadership-roles/",
    "title": "Prof. Prempeh defends lowering presidential age, cites Kufuor’s early leadership roles",
    "text": "Professor Henry Kwasi Prempeh, Chairman of the Constitution Review Committee (CRC), has defended the committee’s recommendation to reduce the minimum age for presidential candidates to 30, responding to concerns that the proposal could allow inexperienced individuals to assume the nation’s highest office.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nSpeaking on the historical context, Prof. Prempeh noted that former President John Kufuor held significant leadership roles at a much younger age.\n\n\n\n“In 1969, we had a ceremonial president, and I think the age was 40 or higher, but real power was with the Prime Minister and the Cabinet. To get into Cabinet, you had to come from Parliament, and the minimum age at the time was 21.\n\n\n\n\"So when former President Kufuor became a Deputy Minister, he was 21—not even 30—because the constitution allowed you to enter Parliament at 21, from where you could be picked as a Cabinet Minister or even Prime Minister,” he explained.\n\n\n\n\n\n\n\nProf. Prempeh stressed that the committee’s proposal aims to expand political participation and give young Ghanaians more opportunities to engage in leadership.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nHe argued that age alone should not determine leadership capacity, pointing to historical examples where young leaders effectively contributed to governance.\n\n\n\nHe urged the public to view the recommendation within the broader context of constitutional reform, which seeks to modernise Ghana’s governance structures and reflect the aspirations of a youthful population.\n\n\n\nAccording to him, lowering the presidential age is part of making the political system more inclusive and forward-looking.\n\n\n\n\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Kufuor                         Prof. Prempeh                \n\n                        \n                    \n                         \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Celebrating Kufuor at 87: Arthur Kennedy hails statesman’s legacy                        \n                     \n\n                    \n                   \n                        \n                            Kufuor says some NPP members wanted him out after his 39% showing in the 1996 election                        \n                     \n\n                    \n                   \n                        \n                            I appointed my brother as Defence Minister because I knew he could deliver – Kufuor justifies                        \n                     \n\n                    \n                   \n                        \n                            Alan Kyerematen rejected my offer to serve as minister in 2000 – Kufuor reveals                        \n                     \n\n                    \n                   \n                        \n                            ‘I never backed Alan Kyerematen against Akufo-Addo’ – Kufuor clears air on old rumours                        \n                     \n\n                    \n                   \n                        \n                            NPP’s 2024 loss a wake-up call on governance and accountability – Kufuor                        \n                     \n\n                    \n                   \n                        \n                            Edudzi Tameklo pays courtesy call on fmr. President Kufuor ahead of NPA @20 celebrations                        \n                     \n\n                    \n                   \n                        \n                            Abronye did not disrespect Kufuor at NPP meeting — Acting National Chairman clarifies                        \n                     \n\n                    \n                   \n                        \n                            Kufuor hails Apostle Safo Kantanka as ‘a grace and a gift’ to Africa                        \n                     \n\n                    \n                   \n                        \n                            Kufuor calls for second chamber of Parliament to vet key appointments",
    "image": null,
    "timestamp": "2025-12-28T01:14:41.417Z"
  },
  {
    "url": "https://www.myjoyonline.com/meet-81-year-old-father-of-ucc-acting-vice-chancellor-who-recently-graduated-with-an-mba/",
    "title": "Meet 81-year-old father of UCC Acting Vice-Chancellor, who recently graduated with an MBA",
    "text": "For the 81-year-old Joseph Aheto, when he realised three years ago in 2022 that all his children had overtaken his level of education and were now professors, he decided to enroll at the University of Cape Coast (UCC) to pursue a Master of Business Administration (MBA) Programme.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nHe obtained his first degree in Business Administration from the University of Ghana in 1978, according to a report published by the University of Cape Coast.\n\n\n\nNot wanting to cite age, family responsibilities, or being a pensioner as a reason to discourage him, he decided to go back to school and pursue higher education. \n\n\n\nHe chose to pursue an MBA in Entrepreneurship and Small Enterprise Development Studies at the UCC, where one of his sons, Prof Denis Aheto, was the then Pro-Vice-Chancellor and currently the acting Vice Chancellor.\n\n\n\n\n\n\n\nThankfully, he successfully went through the programme, and got his son, Prof Dennis Aheto, the current acting Vice Chancellor, congratulating him at the 9th session of the 58th congregation of the university.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nSpeaking to the press, Mr Aheto said he was inspired to pursue further studies when he realised his two sons, who are both professors, had overtaken him.\n\n\n\n“I feel very excited to have my own son graduating me,” Mr Aheto told the press after the graduation ceremony.\n\n\n\nHe said apart from the grace of God, which made this feat possible, his family, course mates, and lecturers also motivated him to push on.\n\n\n\n“When I enrolled and commenced lectures, many of the younger students in my class were surprised and were laughing and mocking me. saying, ‘What at all does this old man want in life? But that didn't deter me. I soldiered on, and now I have graduated,\" he said.\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n\n\nAccording to him, no one should feel too old to go back to school, as learning remains a lifelong adventure.\n\n\n\n\n\n\n\nRecounting his campus days, he said it felt uneasy in the initial months in the lecture halls.\n\n\n\n\"Sitting down for lectures for many hours proved very challenging, considering my age. I had pains in my foot and waist from the long hours of sitting.  But after a few months, I adjusted to the system and gradually shrugged them off and moved on,” he added.\n\n\n\nMr Aheto, who was a class teacher in 1966 before relocating to Nsawam, urged all the graduates to concentrate on their life’s endeavour.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article2'); });\n                    \n                    \n\n\n\nHe advised the younger ones that \"every student who is aspiring to be someone in the future should work hard.\" Whatever you do, do it with resilience and hard work.\n\n\n\nThe acting Vice-Chancellor, Prof Denis Aheto, commended the tenacity and resilience of his father to pursue further studies.\n\n\n\nHe urged the younger ones to eschew the get-rich-quick syndrome and strive to pursue further studies.\n\n\n\n\"Age can never be a limit to education. Old age is about mindset. We need to re-conform as a society,\" he added\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article3'); });\n                    \n                    \n\n\n\n\n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            father                         MBA                         UCC                \n\n                        \n                    \n                         \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Pope accepts Bishop Mante’s resignation, names UCC lecturer to lead Jasikan Diocese                        \n                     \n\n                    \n                   \n                        \n                            UCC appeals for financial clearance for recruitment                        \n                     \n\n                    \n                   \n                        \n                            ‘No room for egos’: Sam Jonah issues bold challenge to UCC graduates and Ghana’s future leaders                        \n                     \n\n                    \n                   \n                        \n                            Rigid school structures make religious freedom ‘very difficult’ – Warns ex-GES Director                        \n                     \n\n                    \n                   \n                        \n                            UCC council ends Prof. Boampong’s tenure, revises contract to expire on his 60th birthday                        \n                     \n\n                    \n                   \n                        \n                            Invest more in aviation safety to prevent future crashes — Dr. Thomas Ojo                        \n                     \n\n                    \n                   \n                        \n                            KNUST dominate 28th GUSA Cross Country and Minor Games                        \n                     \n\n                    \n                   \n                        \n                            Freed Israeli hostage forced to dig own grave is ‘growing back to his old self’, father says                        \n                     \n\n                    \n                   \n                        \n                            Wode Maya celebrates his late father for inspiring his unplanned career in digital storytelling                        \n                     \n\n                    \n                   \n                        \n                            Law Lecturer drags GTEC, UCC to court over VC retirement saga",
    "image": null,
    "timestamp": "2025-12-28T01:15:10.673Z"
  },
  {
    "url": "https://www.myjoyonline.com/at-30-you-lack-the-experience-to-be-a-president-prof-agyeman-duah/",
    "title": "At 30, you lack the experience to be a President – Prof Agyeman-Duah",
    "text": "Former UN Senior Governance Advisor, Prof Kwaku Agyeman-Duah, has opposed proposals to reduce the minimum age requirement for presidential candidates from 40 to 30 years, arguing that the office demands a level of maturity and experience that most people at 30 are unlikely to have attained.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nHe made the comments on Newsfile on JoyNews on Saturday, December 27, during discussions on the ongoing constitutional review being undertaken by the Constitution Review Committee (CRC).\n\n\n\nThe Chairman of the CRC, Professor H. Kwasi Prempeh, has indicated that the Committee is recommending an amendment to Article 62(b) of the 1992 Constitution to lower the minimum age for contesting the presidency from 40 to 30 years.\n\n\n\n\n\n\n\nHowever, Prof Agyeman-Duah questioned the basis for the proposed amendment, stressing that leadership at the level of the presidency requires substantial exposure, maturity and practical experience.\n\n\n\n“Personally, I didn't like the idea of reducing the age from 40 to 30 because I think that at 30 years you don't have enough maturity. Pardon me for those who think I am wrong,” he said.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nHe added that the Ghanaian socio-economic context makes it even more difficult for young people to acquire the depth of experience required to govern effectively by that age.\n\n\n\n“I think if you take the Ghanaian context into account, for instance, most Ghanaians from the villages, as I come from, by the time you finish your first degree, you are almost 27 or 28, and even if by then you have finished your master's degree, what experience do you have, what exposure have you had to run the country? because running the country is not running NUGS organisations,” he explained.\n\n\n\nProf Agyeman-Duah further emphasised that age often brings perspective and judgement that are essential for state leadership.\n\n\n\n“At my age, I know that 30 years simple, you haven't attained the age of maturity to run a state,” he stated.\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n\n\nThe CRC recently presented its constitutional review report to the President as part of its mandate to examine and propose reforms to the 1992 Constitution. Several of the Committee’s recommendations, including the proposed reduction in the presidential age threshold, have since sparked widespread public debate.\n\n\n\nRead also: Constitutional Review Committee proposes lowering presidential age limit from 40 to 30\n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Constitution                         CRC                         Prof Agyeman-Duah                \n\n                        \n                    \n                        \n    \n      \n        \n          \n            \n            \n            \n            \n            \n          \n        \n      \n    \n  Advertisement \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Barker-Vormawor urges President Mahama to lead constitutional reform implementation                        \n                     \n\n                    \n                   \n                        \n                            MP Baffour Awuah advocates for legal framework on presidential continuity, not term extension                        \n                     \n\n                    \n                   \n                        \n                            Ghanaians entitled to propose constitutional changes – Charlotte Osei                        \n                     \n\n                    \n                   \n                        \n                            Four-year term enough for accountability – Inusah Fuseini                        \n                     \n\n                    \n                   \n                        \n                            CRC Proposals: We were very mindful not to create problems while solving existing ones – Charlotte Osei                        \n                     \n\n                    \n                   \n                        \n                            Charlotte Osei describes CRC work as “a privilege of a lifetime”                        \n                     \n\n                    \n                   \n                        \n                            Ablakwa inaugurates SMART classrooms for STEM education                        \n                     \n\n                    \n                   \n                        \n                            Constitution review was inclusive, structured and effective – Prof Prempeh                        \n                     \n\n                    \n                   \n                        \n                            NPP sets up joint committee to review Constitution Review Committee proposals                        \n                     \n\n                    \n                   \n                        \n                            Constitutional Review Committee proposes lowering presidential age limit from 40 to 30",
    "image": null,
    "timestamp": "2025-12-28T01:15:16.836Z"
  },
  {
    "url": "https://www.myjoyonline.com/ndc-cant-change-the-constitution-alone-minority-mps-hold-key-role-says-barker-vormawor/",
    "title": "NDC can’t change the constitution alone – Minority MPs hold key role, says Barker-Vormawor",
    "text": "Convener of the FixTheCountry Movement, Oliver Barker-Vormawor, has observed that the legal process required to amend recommendations by the Constitution Review Committee (CRC) could significantly enhance the influence of the minority in Parliament.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nSpeaking on the constitutional reform debate on JoyNews' Newsfile on Saturday, December 27, Barker-Vormawor explained that any attempt to amend the Constitution would require the support of at least 75 percent of Members of Parliament.\n\n\n\nHe noted that this high threshold effectively prevents a single political bloc from unilaterally driving changes.\n\n\n\n“Every conversation, every discussion must go through Parliament… so as far as this is concerned, once the people approve, all discussions, all changes go through Parliament. It is just a different threshold within Parliament. In my opinion, this is what makes the minority very powerful, irrespective of how small they are,” he said.\n\n\n\nRead also: Playback: Newsfile discussed Constitution review report and AG’s ORAL drive\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nAccording to Barker-Vormawor, even with a parliamentary majority, the National Democratic Congress (NDC) would be unable to meet the constitutional requirement alone, thereby compelling broader consensus and negotiation across the aisle.\n\n\n\n“There is no way you can be able to meet the threshold that is required for the amendments without the minority being part of it. Meaning that there is no way the NDC can run and say we are changing everything without them (Minority),” he explained.\n\n\n\nHis comments come as national attention intensifies around the CRC’s recommendations, with stakeholders assessing both the substance of the proposals and the political arithmetic required to translate them into law.\n\n\n\n\n\n\n\n\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Constitution review                         NDC                         NPP                         Oliver Barker Vormawor                         Parliament                \n\n                        \n                    \n                         \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Let’s prove our readiness power through deeds, not words – Afenyo-Markin to NPP faithful                        \n                     \n\n                    \n                   \n                        \n                            This Saturday on Newsfile: Constitution review report and AG’s ORAL drive                        \n                     \n\n                    \n                   \n                        \n                            Afenyo-Markin urges NPP to move from talk to action after 2024 election loss                        \n                     \n\n                    \n                   \n                        \n                            Afenyo-Markin urges discipline, unity as NPP prepares for 2026 flagbearer primary                        \n                     \n\n                    \n                   \n                        \n                            Ashanti Regional Council of Elders commends NPP minority caucus for parliamentary resilience                        \n                     \n\n                    \n                   \n                        \n                            NPP Chairman aspirant John Boadu vows to rebuild party in Christmas message                        \n                     \n\n                    \n                   \n                        \n                            NDC highlights first year achievements, vows to stabilise economy and strengthen governance                        \n                     \n\n                    \n                   \n                        \n                            2024 defeat revealed governance and candidate failures — Bryan Acheampong                        \n                     \n\n                    \n                   \n                        \n                            One year on, NDC recounts its mandate and promises results in Christmas message                        \n                     \n\n                    \n                   \n                        \n                            No room for excuses – NDC vows to deliver fully on people’s mandate",
    "image": null,
    "timestamp": "2025-12-28T01:19:24.825Z"
  },
  {
    "url": "https://www.myjoyonline.com/100-arrested-in-accras-tabora-in-major-mobile-money-fraud-crackdown/",
    "title": "100 arrested in Accra’s Tabora in major Mobile Money fraud crackdown",
    "text": "The Minister for Communications and Digital Innovation, Samuel Nartey George, has praised a major police-led operation that led to the arrest of 100 suspects in Tabora, a suburb of Accra, over alleged involvement in Mobile Money (MoMo) fraud and other cyber-enabled financial crimes.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nThe coordinated operation, carried out in the early hours of Friday, December 27, involved the Cyber Security Authority (CSA), the Ghana Police Service, National Security, and the Ghana Immigration Service.\n\n\n\nAccording to the Minister, preliminary investigations indicate that the majority of the suspects are Nigerian nationals. Security agencies also seized 38 laptops and 150 mobile phones believed to have been used in committing the offences.\n\n\n\nThe suspected crimes include MoMo fraud, romance scams, sextortion, Business Email Compromise (BEC), and wire fraud.\n\n\n\nA Ghanaian landlord was also arrested for allegedly accommodating about 100 of the suspects in his residence.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\n\n\n\n\n“This operation demonstrates our commitment to protecting Ghanaians and the business environment from cybercrime. Landlords and property owners must ensure their premises are not used to facilitate illegal activity,” the Minister noted.\n\n\n\n\n\n\n\nHe added that forensic analysis of the seized devices is ongoing, and suspects found culpable will be prosecuted under Ghanaian law.\n\n\n\nMr George also urged the public to remain vigilant and report suspicious online activities, while reassuring investors and residents that Ghana remains open to lawful business.\n\n\n\n“We welcome legitimate enterprise, but anyone attempting cybercrime in Ghana will be found, arrested, and dealt with decisively,” he stated.\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n\n\n\n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Fraud                         Mobile Money                         Samuel Nartey George                         Tabora                \n\n                        \n                    \n                         \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Sam George lauds coordinated crackdown on cybercrime in Tabora and Lashibi                        \n                     \n\n                    \n                   \n                        \n                            Ghana-Nigeria cyber-fraud network dupes over 200 victims of $400,000                        \n                     \n\n                    \n                   \n                        \n                            Lawyer arraigned over alleged GH¢800k excavator fraud                        \n                     \n\n                    \n                   \n                        \n                            Cybercrime crackdown: 48 suspects arrested in Dawhenya operation                        \n                     \n\n                    \n                   \n                        \n                            Britain’s worst romance fraudster’ who scammed single mothers out of £1m is jailed for 17 years                        \n                     \n\n                    \n                   \n                        \n                            Ghana recovers over $15m from international crypto fraud syndicate – Attorney General                        \n                     \n\n                    \n                   \n                        \n                            MTN Mobile Money to undergo nationwide agent re-registration in 2026 to curb fraud                        \n                     \n\n                    \n                   \n                        \n                            People were leaking information to fraud suspects – Sam George on past failed cybercrime arrests                        \n                     \n\n                    \n                   \n                        \n                            Hubtel named Overall Best Fintech Partner at 2025 Fintech Stakeholder Dinner & Awards                        \n                     \n\n                    \n                   \n                        \n                            Mobile money transactions hits GH¢3trn as digital payments surge – BoG Report",
    "image": null,
    "timestamp": "2025-12-28T01:19:28.869Z"
  },
  {
    "url": "https://www.myjoyonline.com/tema-oil-refinery-resumes-crude-refining-after-years-of-shutdown/",
    "title": "Tema Oil Refinery resumes crude refining after years of shutdown",
    "text": "The Tema Oil Refinery (TOR) has officially resumed crude oil refining operations after several years of inactivity.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nThe resumption follows the successful completion of major Turnaround Maintenance (TAM) works on the refinery’s Crude Distillation Unit (CDU), carried out between August 1 and October 30.\n\n\n\n The maintenance exercise, completed within three months, was undertaken in line with international engineering, safety, and operational standards, the Managing Director of TOR, Edmond Kombat, disclosed on Facebook.\n\n\n\nAfter the maintenance works, the National Petroleum Authority (NPA) conducted comprehensive regulatory inspections and confirmed that TOR met all mandatory safety and operational requirements. The authority has since granted clearance for the refinery to recommence refining activities.\n\n\n\n\n\n\n\nIn a statement issued on Saturday, TOR explained that refining operations will initially proceed under a phased approach, ahead of the refinery’s formal recommissioning. This period, the company said, will allow for system stabilisation, performance optimisation and the assurance of sustained operational reliability.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nAs part of its upgrade programme, TOR has also completed the installation of a new furnace, F-61, which is expected to be commissioned and integrated into the CDU in the coming months. \n\n\n\nThe installation is projected to restore the refinery’s original nameplate capacity of 45,000 barrels per stream day, up from the current operating level of 28,000 barrels per stream day. Management further outlined a strategic plan to expand capacity to 60,000 barrels per stream day in the medium term, following the installation of a new air cooler.\n\n\n\nThe government of Ghana is expected to formally commission and tie in the F-61 furnace at a later date, with details of the event to be communicated in due course.\n\n\n\nTOR expressed appreciation to President John Dramani Mahama for what it described as his continued support and leadership in restoring the refinery as a key component of Ghana’s energy infrastructure. The refinery also acknowledged the role of the Minister for Energy and Green Transition, Dr John Abdulai Jinapor, citing his technical oversight and policy leadership as instrumental to the revival process.\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n\n\nCommending its board, management and workforce, TOR praised the staff’s resilience and professionalism throughout the restoration journey. The company reaffirmed its commitment to safe, efficient, and sustainable operations as it seeks to reclaim its position as a cornerstone of Ghana’s energy sector.\n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Crude Oil                         Tema Oil Refenery                \n\n                        \n                    \n                        \n    \n      \n        \n          \n            \n            \n            \n            \n            \n          \n        \n      \n    \n  Advertisement \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Ghana records $5.57bn trade surplus in first-half of 2025                        \n                     \n\n                    \n                   \n                        \n                            Ghana saves $1.4bn since commercial export of crude oil                        \n                     \n\n                    \n                   \n                        \n                            Ghana bagged $370.62m from crude oil in first-half of 2025                        \n                     \n\n                    \n                   \n                        \n                            New board inaugurated to revitalise Tema Oil Refinery                        \n                     \n\n                    \n                   \n                        \n                            14 Years of production: Ghanaians see oil as neither blessing nor curse — Research                        \n                     \n\n                    \n                   \n                        \n                            Oil prices fall slightly, but Ghana still at risk as Israel–Iran conflict continues                        \n                     \n\n                    \n                   \n                        \n                            Crude oil production declined for the 5th consecutive year in 2024 – PIAC report                        \n                     \n\n                    \n                   \n                        \n                            Two Nigerian businessmen in court over alleged $20,000 fraud                        \n                     \n\n                    \n                   \n                        \n                            Ghana’s gross reserves end December 2024 at US$8.98bn; trade balance records surplus of  $US4.98bn                        \n                     \n\n                    \n                   \n                        \n                            Fuel prices to go down from tomorrow November 16, 2024 – COPEC",
    "image": null,
    "timestamp": "2025-12-28T01:19:28.916Z"
  },
  {
    "url": "https://www.myjoyonline.com/kidnap-suspect-arrested-in-tamale-as-police-rescue-victim-after-four-days/",
    "title": "Kidnap suspect arrested in Tamale as Police rescue victim after four days",
    "text": "A 26-year-old man, Fuseini Ibrahim, has been arrested in Tamale for allegedly kidnapping a young woman, Haruna Adamu, who was held captive for four days.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nThe incident occurred at Dalogu Yili, a suburb of Tamale, and was reported to the police at about 9:00 a.m. on December 26.\n\n\n\nAccording to reports, the Inspector-General of Police’s (IGP) Special Operations Team, led by Chief Inspector Abdullai Tahiru, responded swiftly to the scene and rescued the victim without incident.\n\n\n\nThe suspect was apprehended and handed over to the Regional Criminal Investigations Department (CID) for further investigation, while the victim was safely reunited with her parents.\n\n\n\nMeanwhile, as part of a festive season crackdown on crime, two suspected drug peddlers were arrested in separate operations in Tamale.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nThe suspects, Ziyad Inusah and Majid Fuseini, were picked up by the IGP Special Operations Team during a routine Christmas patrol.\n\n\n\nThe team, made up of 105 personnel in 10 vehicles, targeted crime-prone areas within the Tamale Metropolis and seized quantities of opioids from one of the suspects.\n\n\n\nThe Ghana Police Service said the operation reflects its commitment to protecting lives and property and intensifying efforts to clamp down on drug peddling and other criminal activities during the festive period.\n\n\n\n\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            kidnap                         Tamale                \n\n                        \n                    \n                         \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            2 nurses, security guard arrested over alleged baby theft at Tamale hospital                        \n                     \n\n                    \n                   \n                        \n                            Police crack down on drug trafficking in Tamale, arrest 4 and seize illicit substances                        \n                     \n\n                    \n                   \n                        \n                            Tamale high court delays ruling in Anbariya vs. Technical University case                        \n                     \n\n                    \n                   \n                        \n                            Police arrest seven in Tamale drug crackdown, seize illicit substances                        \n                     \n\n                    \n                   \n                        \n                            IGP Special Operations Team nabs all-female suspected drug trafficking ring in Tamale                        \n                     \n\n                    \n                   \n                        \n                            Suspected criminal killed in gunfire exchange with police in Tamale                        \n                     \n\n                    \n                   \n                        \n                            Police Special Operations Team storms Tamale, arrests 32 suspects in major anti-crime sweep                        \n                     \n\n                    \n                   \n                        \n                            19 suspects arrested in Tamale and environs during night swoop                        \n                     \n\n                    \n                   \n                        \n                            Police arrest 16 suspects in major crime crackdown in Tamale                        \n                     \n\n                    \n                   \n                        \n                            Tamale residents applaud Cowbell for annual Bike Caravan",
    "image": null,
    "timestamp": "2025-12-28T01:20:01.507Z"
  },
  {
    "url": "https://www.myjoyonline.com/dr-nyaho-nyaho-tamakloe-opposes-presidential-term-extension/",
    "title": "Dr Nyaho Nyaho-Tamakloe opposes presidential term extension",
    "text": "Veteran Ghanaian statesman Dr Nyaho Nyaho-Tamakloe has strongly opposed proposals to extend Ghana’s presidential term, insisting that the existing two four-year terms are sufficient for effective governance.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nIn a statement released this week regarding the ongoing constitutional review, Dr Nyaho-Tamakloe argued that “four years is adequate time for a serious and prepared government to make its mark,” adding that “arguments suggesting a need for additional time only create unnecessary opportunities for inefficiency and corruption.”\n\n\n\nThe former diplomat stressed that while continuity in governance is important, it should not be used as justification for lengthening presidential tenure. “Unfinished national projects must be continued by successive governments. The practice of abandoning ongoing projects in order to initiate new ones has become a major source of waste and corruption,” he said.\n\n\n\nRead Also: Dr Nyaho Nyaho-Tamakloe: On Ghana’s constitution review and the future of democratic governance\n\n\n\nDr Nyaho-Tamakloe also called for a review of provisions that grant excessive immunity and lifelong benefits to public office holders. “The Constitution contains numerous clauses that effectively shield the President during and even after his tenure in office. These protections make it nearly impossible to hold a President fully accountable under the law. This situation is no longer tenable in a mature democracy,” he noted. He further added that “the system of ex gratia payments and excessive post-office benefits for public office holders must be abolished,” urging that these resources be redirected to improve the lives of ordinary Ghanaians.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nOn the structure of government, he supported reforms aimed at strengthening accountability, including appointing ministers strictly from outside Parliament to ensure a clear separation between the Executive and Legislature. “Parliament must be empowered to independently scrutinise government actions without conflict of interest,” he said.\n\n\n\nAddressing leadership qualifications, Dr Nyaho-Tamakloe emphasised that the presidency requires maturity and experience. “The minimum age requirement for presidential candidates should be reviewed upward to reflect the seriousness and responsibility of the office,” he said.\n\n\n\nThe statesman concluded by calling on all stakeholders to approach the constitutional review process with integrity and a focus on national interest. “Constitutional reform must not be driven by partisan interests but by the collective good of the nation,” he urged, highlighting the need for accountability, discipline, and responsible governance.\n\n\n\nDr. Nyaho-Tamakloe’s statement comes ahead of the expected release of the full report of the Constitution Review Committee, which is scheduled for January 2026.\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Constitution Review Committee                         Dr Nyaho Nyaho-Tamakloe                         presidential term extension                \n\n                        \n                    \n                         \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Dr Nyaho Nyaho-Tamakloe calls for abolition of ex gratia payments, excessive benefits for public officeholders                        \n                     \n\n                    \n                   \n                        \n                            Dr Nyaho Nyaho-Tamakloe backs review of presidential immunity provisions in Ghana’s constitution                        \n                     \n\n                    \n                   \n                        \n                            Dr Nyaho Nyaho-Tamakloe: On Ghana’s constitution review and the future of democratic governance                        \n                     \n\n                    \n                   \n                        \n                            Why Ghana’s Constitution Review Committee’s Work Should Be Extended to Strategic Communication                        \n                     \n\n                    \n                   \n                        \n                            How presidential control has weakened Council of State – Prof H. Kwasi Prempeh explains                        \n                     \n\n                    \n                   \n                        \n                            A second look, not a veto – Constitution Review Chair makes case for Council of State reform                        \n                     \n\n                    \n                   \n                        \n                            Too young to lead? – Prof H. Kwasi Prempeh says Ghana’s Constitution undervalues its youth                        \n                     \n\n                    \n                   \n                        \n                            Let the people decide – Constitution Review Chair pushes back against fear of ‘young presidents’                        \n                     \n\n                    \n                   \n                        \n                            Selective justice is destroying trust in Ghana’s anti-corruption system – Prof H. Kwasi Prempeh                        \n                     \n\n                    \n                   \n                        \n                            Ghana’s democratic debate is too insular and afraid of change – Constitution Review Chair",
    "image": null,
    "timestamp": "2025-12-28T01:20:02.306Z"
  },
  {
    "url": "https://www.myjoyonline.com/meet-81-year-old-father-of-ucc-acting-vice-chancellor-who-recently-graduated-with-an-mba/",
    "title": "Meet 81-year-old father of UCC Acting Vice-Chancellor, who recently graduated with an MBA",
    "text": "For the 81-year-old Joseph Aheto, when he realised three years ago in 2022 that all his children had overtaken his level of education and were now professors, he decided to enroll at the University of Cape Coast (UCC) to pursue a Master of Business Administration (MBA) Programme.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nHe obtained his first degree in Business Administration from the University of Ghana in 1978, according to a report published by the University of Cape Coast.\n\n\n\nNot wanting to cite age, family responsibilities, or being a pensioner as a reason to discourage him, he decided to go back to school and pursue higher education. \n\n\n\nHe chose to pursue an MBA in Entrepreneurship and Small Enterprise Development Studies at the UCC, where one of his sons, Prof Denis Aheto, was the then Pro-Vice-Chancellor and currently the acting Vice Chancellor.\n\n\n\n\n\n\n\nThankfully, he successfully went through the programme, and got his son, Prof Dennis Aheto, the current acting Vice Chancellor, congratulating him at the 9th session of the 58th congregation of the university.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nSpeaking to the press, Mr Aheto said he was inspired to pursue further studies when he realised his two sons, who are both professors, had overtaken him.\n\n\n\n“I feel very excited to have my own son graduating me,” Mr Aheto told the press after the graduation ceremony.\n\n\n\nHe said apart from the grace of God, which made this feat possible, his family, course mates, and lecturers also motivated him to push on.\n\n\n\n“When I enrolled and commenced lectures, many of the younger students in my class were surprised and were laughing and mocking me. saying, ‘What at all does this old man want in life? But that didn't deter me. I soldiered on, and now I have graduated,\" he said.\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n\n\nAccording to him, no one should feel too old to go back to school, as learning remains a lifelong adventure.\n\n\n\n\n\n\n\nRecounting his campus days, he said it felt uneasy in the initial months in the lecture halls.\n\n\n\n\"Sitting down for lectures for many hours proved very challenging, considering my age. I had pains in my foot and waist from the long hours of sitting.  But after a few months, I adjusted to the system and gradually shrugged them off and moved on,” he added.\n\n\n\nMr Aheto, who was a class teacher in 1966 before relocating to Nsawam, urged all the graduates to concentrate on their life’s endeavour.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article2'); });\n                    \n                    \n\n\n\nHe advised the younger ones that \"every student who is aspiring to be someone in the future should work hard.\" Whatever you do, do it with resilience and hard work.\n\n\n\nThe acting Vice-Chancellor, Prof Denis Aheto, commended the tenacity and resilience of his father to pursue further studies.\n\n\n\nHe urged the younger ones to eschew the get-rich-quick syndrome and strive to pursue further studies.\n\n\n\n\"Age can never be a limit to education. Old age is about mindset. We need to re-conform as a society,\" he added\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article3'); });\n                    \n                    \n\n\n\n\n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            father                         MBA                         UCC                \n\n                        \n                    \n                         \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Pope accepts Bishop Mante’s resignation, names UCC lecturer to lead Jasikan Diocese                        \n                     \n\n                    \n                   \n                        \n                            UCC appeals for financial clearance for recruitment                        \n                     \n\n                    \n                   \n                        \n                            ‘No room for egos’: Sam Jonah issues bold challenge to UCC graduates and Ghana’s future leaders                        \n                     \n\n                    \n                   \n                        \n                            Rigid school structures make religious freedom ‘very difficult’ – Warns ex-GES Director                        \n                     \n\n                    \n                   \n                        \n                            UCC council ends Prof. Boampong’s tenure, revises contract to expire on his 60th birthday                        \n                     \n\n                    \n                   \n                        \n                            Invest more in aviation safety to prevent future crashes — Dr. Thomas Ojo                        \n                     \n\n                    \n                   \n                        \n                            KNUST dominate 28th GUSA Cross Country and Minor Games                        \n                     \n\n                    \n                   \n                        \n                            Freed Israeli hostage forced to dig own grave is ‘growing back to his old self’, father says                        \n                     \n\n                    \n                   \n                        \n                            Wode Maya celebrates his late father for inspiring his unplanned career in digital storytelling                        \n                     \n\n                    \n                   \n                        \n                            Law Lecturer drags GTEC, UCC to court over VC retirement saga",
    "image": null,
    "timestamp": "2025-12-28T01:20:39.873Z"
  },
  {
    "url": "https://www.myjoyonline.com/prof-prempeh-defends-lowering-presidential-age-cites-kufuors-early-leadership-roles/",
    "title": "Prof. Prempeh defends lowering presidential age, cites Kufuor’s early leadership roles",
    "text": "Professor Henry Kwasi Prempeh, Chairman of the Constitution Review Committee (CRC), has defended the committee’s recommendation to reduce the minimum age for presidential candidates to 30, responding to concerns that the proposal could allow inexperienced individuals to assume the nation’s highest office.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nSpeaking on the historical context, Prof. Prempeh noted that former President John Kufuor held significant leadership roles at a much younger age.\n\n\n\n“In 1969, we had a ceremonial president, and I think the age was 40 or higher, but real power was with the Prime Minister and the Cabinet. To get into Cabinet, you had to come from Parliament, and the minimum age at the time was 21.\n\n\n\n\"So when former President Kufuor became a Deputy Minister, he was 21—not even 30—because the constitution allowed you to enter Parliament at 21, from where you could be picked as a Cabinet Minister or even Prime Minister,” he explained.\n\n\n\n\n\n\n\nProf. Prempeh stressed that the committee’s proposal aims to expand political participation and give young Ghanaians more opportunities to engage in leadership.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nHe argued that age alone should not determine leadership capacity, pointing to historical examples where young leaders effectively contributed to governance.\n\n\n\nHe urged the public to view the recommendation within the broader context of constitutional reform, which seeks to modernise Ghana’s governance structures and reflect the aspirations of a youthful population.\n\n\n\nAccording to him, lowering the presidential age is part of making the political system more inclusive and forward-looking.\n\n\n\n\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Kufuor                         Prof. Prempeh                \n\n                        \n                    \n                        \n    \n      \n        \n          \n            \n            \n            \n            \n            \n          \n        \n      \n    \n  Advertisement \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Celebrating Kufuor at 87: Arthur Kennedy hails statesman’s legacy                        \n                     \n\n                    \n                   \n                        \n                            Kufuor says some NPP members wanted him out after his 39% showing in the 1996 election                        \n                     \n\n                    \n                   \n                        \n                            I appointed my brother as Defence Minister because I knew he could deliver – Kufuor justifies                        \n                     \n\n                    \n                   \n                        \n                            Alan Kyerematen rejected my offer to serve as minister in 2000 – Kufuor reveals                        \n                     \n\n                    \n                   \n                        \n                            ‘I never backed Alan Kyerematen against Akufo-Addo’ – Kufuor clears air on old rumours                        \n                     \n\n                    \n                   \n                        \n                            NPP’s 2024 loss a wake-up call on governance and accountability – Kufuor                        \n                     \n\n                    \n                   \n                        \n                            Edudzi Tameklo pays courtesy call on fmr. President Kufuor ahead of NPA @20 celebrations                        \n                     \n\n                    \n                   \n                        \n                            Abronye did not disrespect Kufuor at NPP meeting — Acting National Chairman clarifies                        \n                     \n\n                    \n                   \n                        \n                            Kufuor hails Apostle Safo Kantanka as ‘a grace and a gift’ to Africa                        \n                     \n\n                    \n                   \n                        \n                            Kufuor calls for second chamber of Parliament to vet key appointments",
    "image": null,
    "timestamp": "2025-12-28T01:20:43.043Z"
  },
  {
    "url": "https://www.myjoyonline.com/one-year-extension-of-presidential-term-unnecessary-baffuor-awuah/",
    "title": "One-year extension of presidential term unnecessary – Baffuor Awuah",
    "text": "Vice Chair of Parliament’s Subsidiary Legislation Committee and a member of the Constitutional and Legal Affairs Committee, Nana Agyei Baffuor Awuah, has described the Constitution Review Committee’s (CRC) proposal to extend the presidential term from four to five years as unnecessary.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nHe made the comments on Newsfile on JoyNews on Saturday, December 27.\n\n\n\nHis remarks follow the submission of the CRC’s final report to President John Dramani Mahama on Monday, December 22.\n\n\n\nThe report contains several key recommendations, including the separation of the legislature from the executive, a reaffirmation that the Constitution does not allow a third presidential term, and a proposal to extend the presidential term of office from four to five years.\n\n\n\nThe CRC has so far presented a summary of its findings to the President, with the full and final report expected to be made public in January.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nSpeaking on the programme, Mr Baffuor Awuah stressed the need for a thorough comparative analysis of the CRC’s proposals against earlier constitutional review efforts, particularly the report of the Professor Fiadjo Committee.\n\n\n\n\n\n\n\n“When you look at the Fiadjo Commission’s report on the tenure of the president, they conducted a historical analysis of where the four years came from,” he explained.\n\n\n\n“The Consultative Assembly initially preferred five years, the Commission of Experts recommended four, and the Powers of Government Committee opted for five. After careful evaluation, they settled on four years.”\n\n\n\nHe questioned the rationale behind the proposed extension, arguing that the justification for giving presidents more time to complete projects is largely impractical.\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n\n\n“The fundamental question is: what mischief are we seeking to cure with this proposed extension? The so-called ‘mischief’ is about giving the president time to finish his work, but practically, no president can complete everything during his tenure,” he said.\n\n\n\nMr Baffuor Awuah noted that presidents routinely initiate projects, contract loans, and pass legislation whose full impact often extends beyond their time in office.\n\n\n\nExtending the term by just one year, he argued, would not change that reality.\n\n\n\n“The issue really has to do with continuity. We should focus on passing laws or mechanisms that ensure continuity, rather than simply extending the president’s term,” he said.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article2'); });\n                    \n                    \n\n\n\n“Adding one more year will not enable the president to finish everything he starts. We need to look at how best we can achieve continuity effectively.”\n\n\n\n\n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Nana Agyei Baffuor Awuah                         presidential tenure                \n\n                        \n                    \n                        \n    \n      \n        \n          \n            \n            \n            \n            \n            \n          \n        \n      \n    \n  Advertisement \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            I don’t believe OSP will disregard proper discretion – Lawyer on Charles Bissue’s arrest warrant",
    "image": null,
    "timestamp": "2025-12-28T01:20:43.842Z"
  },
  {
    "url": "https://www.myjoyonline.com/at-30-you-lack-the-experience-to-be-a-president-prof-agyeman-duah/",
    "title": "At 30, you lack the experience to be a President – Prof Agyeman-Duah",
    "text": "Former UN Senior Governance Advisor, Prof Kwaku Agyeman-Duah, has opposed proposals to reduce the minimum age requirement for presidential candidates from 40 to 30 years, arguing that the office demands a level of maturity and experience that most people at 30 are unlikely to have attained.\n    \n        googletag.cmd.push(function() { googletag.display('mjo-article-left_rectangle_mid'); });\n    \n    \n\n\n\nHe made the comments on Newsfile on JoyNews on Saturday, December 27, during discussions on the ongoing constitutional review being undertaken by the Constitution Review Committee (CRC).\n\n\n\nThe Chairman of the CRC, Professor H. Kwasi Prempeh, has indicated that the Committee is recommending an amendment to Article 62(b) of the 1992 Constitution to lower the minimum age for contesting the presidency from 40 to 30 years.\n\n\n\n\n\n\n\nHowever, Prof Agyeman-Duah questioned the basis for the proposed amendment, stressing that leadership at the level of the presidency requires substantial exposure, maturity and practical experience.\n\n\n\n“Personally, I didn't like the idea of reducing the age from 40 to 30 because I think that at 30 years you don't have enough maturity. Pardon me for those who think I am wrong,” he said.\n                    \n                        googletag.cmd.push(function() { googletag.display('in-article'); });\n                    \n                    \n\n\n\nHe added that the Ghanaian socio-economic context makes it even more difficult for young people to acquire the depth of experience required to govern effectively by that age.\n\n\n\n“I think if you take the Ghanaian context into account, for instance, most Ghanaians from the villages, as I come from, by the time you finish your first degree, you are almost 27 or 28, and even if by then you have finished your master's degree, what experience do you have, what exposure have you had to run the country? because running the country is not running NUGS organisations,” he explained.\n\n\n\nProf Agyeman-Duah further emphasised that age often brings perspective and judgement that are essential for state leadership.\n\n\n\n“At my age, I know that 30 years simple, you haven't attained the age of maturity to run a state,” he stated.\n                    \n                        googletag.cmd.push(function() { googletag.display(\"in-article1\"); });\n                    \n\n\n\nThe CRC recently presented its constitutional review report to the President as part of its mandate to examine and propose reforms to the 1992 Constitution. Several of the Committee’s recommendations, including the proposed reduction in the presidential age threshold, have since sparked widespread public debate.\n\n\n\nRead also: Constitutional Review Committee proposes lowering presidential age limit from 40 to 30\n\n                DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.      \n             \n \n                \n                     Tags:                            Constitution                         CRC                         Prof Agyeman-Duah                \n\n                        \n                    \n                         \n                        DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. \n                 \n\n        \n    \n        Related to this story\n        \n            \n                   \n                        \n                            Barker-Vormawor urges President Mahama to lead constitutional reform implementation                        \n                     \n\n                    \n                   \n                        \n                            MP Baffour Awuah advocates for legal framework on presidential continuity, not term extension                        \n                     \n\n                    \n                   \n                        \n                            Ghanaians entitled to propose constitutional changes – Charlotte Osei                        \n                     \n\n                    \n                   \n                        \n                            Four-year term enough for accountability – Inusah Fuseini                        \n                     \n\n                    \n                   \n                        \n                            CRC Proposals: We were very mindful not to create problems while solving existing ones – Charlotte Osei                        \n                     \n\n                    \n                   \n                        \n                            Charlotte Osei describes CRC work as “a privilege of a lifetime”                        \n                     \n\n                    \n                   \n                        \n                            Ablakwa inaugurates SMART classrooms for STEM education                        \n                     \n\n                    \n                   \n                        \n                            Constitution review was inclusive, structured and effective – Prof Prempeh                        \n                     \n\n                    \n                   \n                        \n                            NPP sets up joint committee to review Constitution Review Committee proposals                        \n                     \n\n                    \n                   \n                        \n                            Constitutional Review Committee proposes lowering presidential age limit from 40 to 30",
    "image": null,
    "timestamp": "2025-12-28T01:21:16.729Z"
  }
]